{
  "total_files_scanned": 243,
  "files_with_problems": 122,
  "files": [
    {
      "file": "data/metadata/journal/2021/2021-08-03.yaml",
      "date": "2021-08-03",
      "summary": "First explicit experience of gender-based discomfort in an academic setting when a man corrects her in the tutorial group. The narrator confronts internalized transphobia: \"there is still a small voice in the back of my head telling me that I have no right to talk about the issue of women in STEM. That I don't count as a real woman.\" Five years on hormones and still doubting her legitimacy. She navigates texting with a love interest, attempting forced detachment on a friend's advice, but the conversation continues anyway. A flashback to a party—being called \"hermosa.\" Significant sexuality questioning emerges as she notices attraction to men while watching a video, triggering memories of almost-kissing a man at a party, the urge to touch his chest. The entry ends with the elephant in the room: even if things go well, trans disclosure looms.",
      "problematic_scenes": [
        {
          "name": "Party Flashback: Hermosa",
          "description": "Memory of a party: the love interest looking her in the eyes and saying \"te ves hermosa\" while someone applies a temporary tattoo.",
          "reason": "contains colon"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2021/2021-08-07.yaml",
      "date": "2021-08-07",
      "summary": "Brewery outing without the woman she's interested in, who cancels. The roommate reveals she's \"too immature, in that youth phase of dating so much\"—claiming she went on four dates that week. The narrator confesses she lied to her roommate about the cancellation. Feeling intimidated by the competition, she asks if there will be a message Sunday. At the brewery, drunk, she mentions peeing her pants once and the roommate's assumptions suggest she might be passing—a subtle test. Missing her dog back home, whose mother reports no longer sleeps in her bed because the sheets don't smell like her anymore. An ex reassures her she doesn't see \"masculine features\"—contradicting earlier statements about trans visibility being obvious.",
      "problematic_scenes": [
        {
          "name": "Memory: The Question",
          "description": "Francisco once wondered if she was trans, transitioning \"in the other direction\"; his girlfriend told him not to ask.",
          "reason": "contains colon"
        },
        {
          "name": "Memory: Contradictions",
          "description": "An ex says she always thought the narrator had \"fine features,\" contradicting her earlier statement that her transness was \"obvious.\"",
          "reason": "contains colon"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2021/2021-08-14.yaml",
      "date": "2021-08-14",
      "summary": "A day of layered revelations. Armando leaves for Ottawa; Flore still hasn't replied from the chalet. At a market outing, then drinks in Old Montreal with strangers, someone asks the question that punctures the narrator's avoidance: \"Why didn't you come yesterday? It was Molly's birthday!\" The rejection has become social knowledge—everyone knows. Molly felt \"weird about going out with a friend of a friend.\" She's now seeing someone else, also named Molly. Meanwhile, Monica warns that someone will get hurt in the Sonny situation; the narrator tries to have the conversation but Sonny's final message—\"Yo sé\"—goes unanswered. \"My eyes were crying all day.\" But the narrator can't locate the wound: \"It is not about Molly's, now clear, rejection; or the anxiety about Flore's potential rejection... Why do I feel like crying now, for real?\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Why Didn",
          "scenes": [
            "The Balcony Invitation",
            "The Market Outing"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "S Birthday",
          "scenes": [
            "Monica's Warning"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-08-21.yaml",
      "date": "2021-08-21",
      "summary": "Tinder conversations dying one after another. Messages to multiple women go unreplied. \"I am such a shitty excuse of a person.\" A sex dream where she's with her ex as a man surfaces—triggering \"guilty sense of disgust and shame\" at dreaming in male form. Plans to meet a friend provide distraction. A conversation about SRS in Thailand leads to a tender moment of allyship—being asked to teach how to be a better ally. \"You're not 'my trans woman friend.' Siempre que hablo de ti es como mujer.\" Sitting in a park waiting, she fantasizes about seeing a woman ride past on a red bike, disappearing into the horizon.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S With Her Ex As A Man",
          "scenes": [
            "SRS in Thailand",
            "Enseñame",
            "The Correct Language",
            "Jeanne Mance Park"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-08-23.yaml",
      "date": "2021-08-23",
      "summary": "The narrator can't get out of bed, hiding under her pillow from the sunlight. A date with M is planned for Thursday - half-Moroccan, just broken up with someone. \"I am such a piece of shit sometimes. I just hope I won't do what Flore did to me.\" She deletes Molly's number easily but Flore's is harder - she keeps checking until the name disappears from WhatsApp. A match with M happens despite no attraction: \"I need the distraction.\" The trans disclosure becomes a weapon in her mind: \"It is my card under my sleeve. Whenever I see the situation with M going nowhere I could just come out and let her end things herself.\" The entry ends in dark self-punishment: \"Sometimes I can feel so alone. For a minute, I even forget that I deserve it.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "T Do What Flore Did To Me",
          "scenes": [
            "The Obsessive Ritual"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "S Number Easily But Flore",
          "scenes": [
            "Under the Pillow",
            "The Cringe Draft",
            "The Distraction Date",
            "Deleting Contacts"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-08-30.yaml",
      "date": "2021-08-30",
      "summary": "A memory surfaces: the Estonian girl from study abroad in Portugal, seven years ago. They kissed on a dance floor and she stopped it — \"I was a really nice guy, but she just wanted to dance.\" The narrator remembers the cathedral picture, the napkin flower on the bus ride home. \"I was obsessed with her for a while.\" Looking her up now, she's pregnant in photos. They're not Facebook friends anymore — not since the coming out. \"Does she know, or even imagine, that I look nothing like that guy with messy curls and sad eyes?\" The entry ends with fragile hope: maybe in a couple of months, she'll look back and laugh about her current obsessiveness.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Pregnant In Photos They",
          "scenes": [
            "The Dance Floor",
            "The Rejection",
            "The Wandering",
            "The Bus Ride Home",
            "The Song",
            "The Beach Notebook"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-09-04.yaml",
      "date": "2021-09-04",
      "summary": "The narrator wanders through Little Italy deliberately searching for a woman who ghosted her: \"Consciously, I knew I wasn't going to see her... If she did, it would seem as if I were literally stalking her. Was I?\" The self-awareness of the obsessive behavior coexists with continuing it. She's misgendered as \"senora\" at a Latino market - incorrect but at least feminine. Catching her reflection unexpectedly: \"I didn't recognize myself.\" Body dysmorphia and geographical haunting converge as she walks streets hoping to catch a glimpse of someone who rejected her.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Consciously I Knew I Wasn",
          "scenes": [
            "Searching the Crowd",
            "Departure Without Preparation"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "I Didn",
          "scenes": [
            "The Pathetic Confession",
            "The Picnic Avoidance",
            "Tree-Reading and the High School Bench",
            "The Deliberate Detour",
            "The Unrecognized Reflection"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-09-12.yaml",
      "date": "2021-09-12",
      "summary": "A memory of Eusebio sleeping shirtless surfaces: \"Never in my life have I slept shirtless. That is until last night.\" For the first time, she sleeps in just underwear - a small gendered embodiment milestone. A 10km photography walk yields disappointing results: \"They are just like me... boring, not even mediocre.\" She wonders why she bought a camera for self-portraits when she's too disgusted by her appearance to photograph herself. A sexual dream about her roommate creates tension she quickly dismisses.",
      "problematic_scenes": [
        {
          "name": "Party Memory (Playas de Tijuana, years ago)",
          "description": "Recalls being drunk after a post-Spain party, unable to stop talking in the car while friends told her to shut up. Later slept at Eusebio's place.",
          "reason": "contains parentheses"
        },
        {
          "name": "Night in Underwear (Montreal apartment)",
          "description": "Reads about photography, hears midnight party outside, removes hoodie and sleeps only in underwear for the first time.",
          "reason": "contains parentheses"
        },
        {
          "name": "10 Kilometer Walk (Montreal streets)",
          "description": "Walks for hours attempting street photography, struggles to point camera at strangers, returns with only a handful of shots she deems worthless.",
          "reason": "contains parentheses"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2021/2021-09-14.yaml",
      "date": "2021-09-14",
      "summary": "Watching the TV series Y: The Last Man triggers profound dysphoria: \"If I were in that world, I'd have died with the men. The rest of them. The other men.\" Despite years of transition, she imagines dying with the men in a hypothetical extinction event. Digital surveillance continues - seeing pictures from Paris. She mutes a profile after an inappropriate message about nude pictures, acknowledging: \"She has a girlfriend after all. I was out of line.\" She buys an iPhone despite not needing it, seeking excitement through consumerism. A memory surfaces of telling a date about coming out to her mother, who cried not from disappointment but from guilt at not being there during her pain. \"I keep spending money on frivolous shit, and I'm still drinking myself to sleep.\"",
      "problematic_scenes": [
        {
          "name": "Y: The Last Man",
          "description": "Watching the TV series alone, struck by dysphoric recognition: she would have died with \"the other men.\"",
          "reason": "contains colon"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2021/2021-09-20.yaml",
      "date": "2021-09-20",
      "summary": "Preparing for therapy, she rehearses what to say about the closet: \"I could tell how the next girl after Flore was Alice, this pretty trans girl with whom things went so fast that I felt disoriented.\" The Alice realization crystallizes: \"It wasn't because she's trans. It was because she's trans *like me*.\" The theory extends: maybe Molly and Flore felt the same revulsion toward her. The functional alcoholism question becomes explicit: \"Am I a functional alcoholic? Am I functioning enough?\" The tears feel stuck. \"I am not functioning... I am just an alcoholic.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "It Wasn",
          "scenes": [
            "Golden Hour Fantasy",
            "The Encouraging PI",
            "Promise-Breaking Drink",
            "Therapy Rehearsal",
            "The Alice Mirror",
            "The Projection Theory",
            "Tears That Won't Come",
            "Nothing Works Litany",
            "The Unfollow"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-09-21.yaml",
      "date": "2021-09-21",
      "summary": "All-night drunk reading of old journal entries: \"I started crying, listening to music and crying.\" At 3am, she translates an old therapy exercise for an ex—a reciprocity gesture. Reading about a past lover's journal-writing on the beach: \"I still wonder if she wrote about me in there. I would like to know. So maybe she'd like to know as well.\" In-person therapy reveals the core frustration: \"Everything comes back to it and I hate it\"—being trans as inescapable lens. Financial anxiety mounts with impulsive purchases. A reply arrives to her Facebook message; she hides the notification.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Journal-Writing On The Beach",
          "scenes": [
            "The 3am Translation",
            "Calculation of Sleep",
            "Financial Reckoning",
            "Pre-Dawn Departure",
            "The Held-Back Session"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-09-22.yaml",
      "date": "2021-09-22",
      "summary": "Memory gap from the previous night: \"I don't remember most of last night. I know I slept in the afternoon, around 3 or 4 hours. After that, it's all blurry.\" The blackouts become normalized. Reading early transition journal entries triggers reflection: \"Why did I keep talking to them?\" Being affectionate as a boy felt wrong; as a trans woman it feels predatory - she can't win. She rationalizes her exclusion from a wedding through geography and transness. Therapy continues to probe restriction patterns around food.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "I Don",
          "scenes": [
            "The Unfinished Slides",
            "The Crashed Software",
            "Waking at Noon"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "S All Blurry",
          "scenes": [
            "The Blurry Night",
            "Message Seen, No Reply",
            "The Cafe Memory"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-09-23.yaml",
      "date": "2021-09-23",
      "summary": "Looking at early transition photos: \"I looked hideous. I remember how the first two years I'd go back to the pictures and be proud of my smiles... It's all bullshit.\" The trans joy narrative collapses - what felt like progress now reads as delusion. In a Zoom meeting, someone refers to her as part of the \"creeps from Louis' lab\" - the word stings. Looking up old journal entries: \"He accepted, I narrated. He's not in my Facebook, though.\" The discrepancy between journal-narrative and reality. She finally understands how she hurt an ex-friend years ago through self-centered neediness. The guilt is retrospective but genuine.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S All Bullshit",
          "scenes": [
            "Browsing Transition Photos",
            "Trans Joy Narrative Collapses",
            "Unable to Rise",
            "Lab Meeting in Spanish"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "S Not In My Facebook Though",
          "scenes": [
            "Guilt Arrives Late",
            "Package Vigil",
            "Trip Hesitation"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-09-25.yaml",
      "date": "2021-09-25",
      "summary": "Quebec City trip planning devolves into anxiety spiral. \"Where do I belong?\" - not wanting to stay in Montreal but not wanting to return to Tijuana either. Border anxiety surfaces: \"If they don't [open the border], I have an excuse to not go home.\" Using external circumstances as excuses for internal resistance. Tour packages seem easier than solo exploration - structured itineraries as defense against loneliness. Broken promises about alcohol, lingering roommate tension, and a rejected NYC plan with a friend compound the displacement feeling.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "If They Don",
          "scenes": [
            "Father's Message",
            "The Ignored Message",
            "Tours vs. Exploration",
            "The NYC Rejection"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-09-29.yaml",
      "date": "2021-09-29",
      "summary": "Extreme distraction: \"I can't focus. Is this anxiety still?\" The archive reading has reached present entries: \"I got to the end and ended up feeling disappointed that there were no more. I know what happens later, I lived it.\" The strange desire for more of one's own past. A birthday invitation shifts travel plans from cancelled Quebec trip to potentially Mexico. A beach memory surfaces: \"those two guys from the boat place that kept misgendering me\" - the anticipatory dread of bathing suits, bad shaving, being seen wrong.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "I Can",
          "scenes": [
            "Getting Cold",
            "Breaking Bad Credits",
            "Archive Exhausted",
            "5am Sleeplessness"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-10-07.yaml",
      "date": "2021-10-07",
      "summary": "Insomnia continues - second sleepless night. In therapy, Calli asks: \"What's the worst thing that could happen tonight?\" The answer comes readily: \"I could go and buy a bottle... get very, very drunk. And... could even end up cutting myself again.\" The self-harm possibility named aloud to a professional. Instagram post gets unusual attention. Conversation about not being invited to a friend's wedding, the story of distancing from the friend group. The exclusion pattern: friends drifting away, events happening without her.",
      "problematic_scenes": [
        {
          "name": "Therapy: Naming the Worst Case",
          "description": "Calli asks about impending doom. The answer comes clearly: bottle, drunk, cutting again. The scenario articulated to a professional.",
          "reason": "contains colon"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2021/2021-10-20.yaml",
      "date": "2021-10-20",
      "summary": "The entry opens with a striking line: \"Meditation is preparation for death.\" Unexplored but haunting. The sleep medication and alcohol combination worked - she slept but skipped gym and lab. Contact lenses become another avoidance spiral: fear of trying again, fear of avoiding too long. The algorithm work continues in theory: figured out the cross-validation approach but coded nothing. The imposter syndrome intensifies: \"I feel so stupid, like an impostor. He's going to figure me out. He's starting to.\" The phone-checking compulsion for phantom messages - looking for notifications that aren't there.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Starting To",
          "scenes": [
            "Should I Go Tomorrow"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-11-06.yaml",
      "date": "2021-11-06",
      "summary": "Dream about a woman where \"this time you were you, not a male version of you.\" Deletes all dating apps after creating new Tinder account with the same results—zero likes, the same cycling faces. A follow request remains unaccepted. Stalks an ex's Instagram while insisting she doesn't care. Final line: \"I just want to feel something.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Instagram While Insisting She Doesn",
          "scenes": [
            "The Dream, Suppressed",
            "Morning Haze",
            "The Cycle Repeats",
            "Attention as Attraction"
          ],
          "reason": "starts with single letter T/S (likely truncated); ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-11-08.yaml",
      "date": "2021-11-08",
      "summary": "Extended coming-out narrative to parents (quoted in Spanish) - childhood alienation, bathroom trauma, fascination with androgynous TV child (\"yo quería eso\"), Spain pre-transition panic and weight loss, abandoning the person who helped explore gender, hospital misgendering induced vomiting. Meanwhile: dating app matches don't reply, therapy session about dysphoria, wine and waiting for a promised joint.",
      "problematic_scenes": [
        {
          "name": "The Confession (Spanish monologue)",
          "description": "Extended coming-out narrative to parents, voice shifting between present explanation and childhood memory.",
          "reason": "contains parentheses"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2021/2021-11-10.yaml",
      "date": "2021-11-10",
      "summary": "Misgendered at pharmacy picking up antidepressants - \"that small and insignificant moment can mess up with my whole day.\" Starting escitalopram tomorrow. 60+ dating app likes, no conversations continue. After days of waiting, the Instagram follow-back arrives: \"I feel absolutely nothing. I wasn't expecting to get excited about the idea, but there's not even a slight relief I wasn't creeping.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "I Feel Absolutely Nothing I Wasn",
          "scenes": [
            "Horny and Sad",
            "Wrong Line, Wrong Name",
            "The Sir",
            "The Call for Estrogen"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "S Not Even A Slight Relief I",
          "scenes": [
            "60 Likes, Zero Conversations",
            "Last Sleeping Pill",
            "Prepaid Card Bureaucracy",
            "Domestic Routines"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-11-13.yaml",
      "date": "2021-11-13",
      "summary": "Kate date goes well (\"just like Flore's\") - lunch, cat café line, bubble tea, Old Port walk. Meghan at club says \"You're very pretty.\" But: \"it was [nice]. But then again, so was Flore's and I know how that ended.\" Previous night: panic from getting erection while grinding with girl at club, realizes \"Alda really doesn't know I am transgender... Why does it still feel like I betrayed her?\" Mentions \"Aliza's night\" to discuss with Calli.",
      "problematic_scenes": [
        {
          "name": "Dance Floor Panic (Memory)",
          "description": "Previous night resurfaces: erection forming while grinding with a girl at the club.",
          "reason": "contains parentheses"
        },
        {
          "name": "Passing Guilt (Reflection)",
          "description": "Alone with the realization: friend doesn't know she's trans. \"I didn't lie... Why does it still feel like I betrayed her?\"",
          "reason": "contains parentheses"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2021/2021-11-17.yaml",
      "date": "2021-11-17",
      "summary": "COVID negative. She's busy this weekend (Ottawa trip) - \"This would be the third girl that disappears after a weekend trip.\" Self-awareness spiral: \"I am not taking this, her, in a healthy way... And here I am fixating on this other girl with whom I exchanged an afternoon; talking about her to all the people I know. God, I hate myself sometimes. What void am I trying to fill with these people?\" Previous rejection remembered. Nightclub encounter questioned - would a hookup fill the void?",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Busy This Weekend Ottawa Trip -",
          "scenes": [
            "Middle of Night Relief",
            "Morning Proposal",
            "The Disappointment",
            "The Third Girl Pattern"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-11-21.yaml",
      "date": "2021-11-21",
      "summary": "Hangover morning, half-empty vodka bottle. An ex's wedding surfaces on Instagram. Roommate's enthusiasm about narrator's trans date reveals fetishistic curiosity; narrator almost asks a follow-up question but \"didn't really want an answer.\" First time imagining self as bride: \"In my almost 30 years, I don't think I've ever imagined myself as a bride.\" The entry ends in self-negation: \"Why would she have been [interested]? *Why would anyone ever be?*\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Wedding Surfaces On Instagram Roommate",
          "scenes": [
            "Hangover Inventory",
            "The Wedding Story",
            "The Checklist Moment",
            "The Bride Fantasy"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "T Really Want An Answer",
          "scenes": [
            "Maykol",
            "The Core Wound"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-11-23.yaml",
      "date": "2021-11-23",
      "summary": "Vodka finished in just over a weekend. Therapy session about Kate/Flore comparison, struggling with \"the unspoken rules and conventions, the code. Things that go without saying, but I am not able to comprehend.\" Instagram camera self-image: \"the girl on the phone wasn't the usual one that makes me cringe. She just looked in so much pain that I wanted her to materialize and hug her. I wish I could sit by my own side and just cry in my own shoulder.\" Passing undetected by roommate about period question yields loneliness, not relief: \"en vez de sentirma contenta, me sentí *sola*.\" Two failed disclosure attempts with roommate on balcony. Romantic interest finally replies.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "The Girl On The Phone Wasn",
          "scenes": [
            "Snow Morning Reflection",
            "Vodka Inventory",
            "Balcony Joint, First Attempt",
            "Resolution to Numb"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-11-24.yaml",
      "date": "2021-11-24",
      "summary": "Work prep undone, obsessing over a woman's Whatsapp activity. Antidepressants \"messing with me\" after two weeks. Didn't want to wake up, \"pillow over my face.\" Friend's mom said narrator's trans status \"was not obvious\" - stopped replying. The woman asks about a book but doesn't answer follow-up. Intrusive thought: \"*Ya me dijo de ti, que sigues encima de ella y no sabe como decirte que no. Eres feo, tío, acéptalo*.\" Chin-hiding habit. Doesn't care about upcoming trip anymore. Old friend sends pre-transition photo, closure discussion about another friend.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Whatsapp Activity Antidepressants",
          "scenes": [
            "Opening Dialogue Fragment",
            "Midnight Work Session",
            "The Pillow",
            "The Intrusive Voice"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "After Two Weeks Didn",
          "scenes": [
            "The Revelation",
            "The Second Intrusion",
            "The Bathroom Walk",
            "The Photo Arrives",
            "Closure Contemplation"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-11-28.yaml",
      "date": "2021-11-28",
      "summary": "Queer bar with friend - blonde girl smiles multiple times. Extended reflection on smiles: early transition \"complicit, like getting into this secret joke\" vs passing smiles \"warm, sharing a sensation of belonging.\" Can't tell which kind blonde's smiles were. \"If she were interested, she didn't show it. Women around here are too nice.\" Posts winter pictures on Instagram: \"People liked them, but not the person I was hoping.\" Still thinking about her ex despite saying \"I think about her too much. I hate it.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "T Tell Which Kind Blonde",
          "scenes": [
            "Walk with Alda"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "If She Were Interested She Didn",
          "scenes": [
            "Instagram Bait"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-11-29.yaml",
      "date": "2021-11-29",
      "summary": "Sends Kate message pretending changed numbers (\"idk why I thought Whatsapp would automatically tell my contacts\"). Armando says it doesn't notify - brief hope she messaged and he didn't get it, but Eliseo sends screenshot proving notification exists: \"Before the pieces of my crushed hope could hit the ground.\" Experiments swiping right on men in Bumble - first match, panic: \"a betrayal to my own sexual identity. I was caught red-handed in my own sexual temptation.\" Guy deletes match immediately: \"sucker punch to my sexual self-worth.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "T Notify - Brief Hope She Messaged",
          "scenes": [
            "The Smooth Lie",
            "One Checkmark Vigil",
            "Noon Paralysis",
            "The Betrayal Match"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-12-04.yaml",
      "date": "2021-12-04",
      "summary": "A weekend of compulsive digital management: deleting and re-engaging Kate's conversation, messaging Alix while she's at karaoke, video chats with Eliseo and Sonny. Eliseo's compassionate response to the narrator's confession of being \"too pushy and needy\" releases tears that had been held for days.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Conversation Messaging Alix While She",
          "scenes": [
            "Kate's Return",
            "Karaoke Flirtation",
            "Saturday Stillness",
            "Eliseo's Video Call"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "S Compassionate Response To The Narrator",
          "scenes": [
            "Sonny's New Person",
            "Monica's Morning Report"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2021/2021-12-05.yaml",
      "date": "2021-12-05",
      "summary": "Drunk and high with roommates, sends \"fuckboi\" message expecting to be blocked; friend's harsh critique: \"You don't like them, you want to look like them.\" Self-sabotage as ritual, attraction as aspiration, the slip about trans Grindr users that raises roommates' suspicion.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Harsh Critique",
          "scenes": [
            "The Unexpected Reply"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-13.yaml",
      "date": "2022-01-13",
      "summary": "The entry opens a pivotal period in Montreal life, returning from Mexico with a romantic obsession already taking root. The pattern of checking Instagram stories for attention begins here, establishing the digital surveillance behavior that will define much of 2022. The hospital visit during a family trip provides biographical context about health issues. The condom purchase triggers dysphoria about pregnancy and fatherhood, revealing the complex relationship with her trans body. Weight tracking at 70kg shows ongoing body consciousness, and the mention of a foundational friendship establishes the support network.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Waiting (2022-01-13)",
          "scenes": [
            "The Instagram Dance",
            "The Haircut"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Writing (2022-01-13)",
          "scenes": [
            "The Pharmacy",
            "Composing the Message"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-14.yaml",
      "date": "2022-01-14",
      "summary": "A sleepless night yields profound trans-specific dysphoria around sexuality and reproduction. The masturbation scene is visceral, staining blue sheets, prompting existential questions about fertility and the horror of fathering a child. The condom dysphoria is articulated with clarity: the mild discomfort of wearing one is nothing compared to the unthinkable prospect of pregnancy. The entry features drafted sensual texts that reveal the depth of romantic longing, yet self-awareness emerges with the admission that this situation is not working. Stress manifests as crawling sensations on skin, the urge to scratch oneself raw. A therapy appointment is scheduled, and the mention of grandma's antipsychotics foreshadows future psychiatric themes.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2022-01-14)",
          "scenes": [
            "Unsent Sensual Message",
            "Sleepless Dawn",
            "Trans Healthcare Debate",
            "Seeking Molly"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Walking (2022-01-14)",
          "scenes": [
            "Masturbation and Fertility Fears",
            "Condom Calculus",
            "Self-Doubt Spiral"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-15.yaml",
      "date": "2022-01-15",
      "summary": "A key entry for understanding the narrator's romantic psychology. The question \"Am I being obsessive?\" opens a self-aware examination of attachment patterns. A dream about an ex having cancer triggers memories of her actual surgery from before they dated. The narrator articulates a significant insight about her attachment style: she loses interest when someone becomes more interested in her, citing patterns with past partners. With the current romantic interest, the dynamic is reversed—she's less interested—which paradoxically fuels the obsession. COVID test returns negative; waiting continues.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Romantic Psychology The Question",
          "scenes": [
            "The Invitation",
            "Am I Being Obsessive?",
            "The Letter Never Sent",
            "The Dream",
            "The Pattern",
            "The Reversed Dynamic",
            "The Surveillance",
            "Something Missing"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-16.yaml",
      "date": "2022-01-16",
      "summary": "Depression descends with familiar symptoms: inability to get out of bed, zero motivation, numbness. The entry contains a significant moment of gender-feeling confusion, questioning whether she hates certain feelings because they are feminine or because they seem immature. The meta-narrative awareness is striking—self-consciousness about her own obsessiveness shows literary sensibility. Kate continues to watch Instagram stories without engaging, fueling the surveillance dynamic. An Instagram story about longing for email exchanges reveals desire for more intimate communication forms.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-01-16)",
          "scenes": [
            "The Bed Prison",
            "The Negative Result",
            "The Third Message"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-17.yaml",
      "date": "2022-01-17",
      "summary": "A pivotal articulation of trans grief emerges in the form of a tweet that was posted then deleted: \"As a trans woman, I would take the red pill no matter the amount of money... I wouldn't prefer any amount of money in the world against the chance of having grown up as a normal girl.\" This public confession, removed an hour later, captures the core wound of never having had a female childhood. The entry also documents therapy focused on passing anxiety, revealing ongoing struggles with being read as a woman in public. An email to a friend continues the correspondence that serves as emotional anchor. The tension between public confession and private retreat is captured in the deletion of the tweet.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Waiting (2022-01-17)",
          "scenes": [
            "Typing, Typing",
            "Morning Inertia",
            "The Lab Meeting",
            "Therapy Session",
            "The Passing Inventory",
            "The Red Pill Tweet",
            "The Deletion"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-19.yaml",
      "date": "2022-01-19",
      "summary": "The entry captures a defining psychological pattern: \"I want to be the first one to stop caring, to leave before being abandoned.\" This preemptive rejection impulse illuminates the Kate obsession and many romantic failures to come. An email to a friend about the multiverse is finished, containing the poetic line \"only I have you,\" expressing singular friendship in infinite possibilities. Tinder is reactivated with the trans flag added to the bio, marking an evolution in dating app disclosure strategy. The self-awareness deepens with the admission that Kate occupies more mental real estate than is reciprocated, and the uncomfortable truth that this imbalance \"shouldn't be.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Shouldn",
          "scenes": [
            "Profile Haunting",
            "The Disappointing Date Remembered"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "Messaging (2022-01-19)",
          "scenes": [
            "The Unread Reply",
            "Mental Real Estate",
            "Tomorrow's Errands"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-20.yaml",
      "date": "2022-01-20",
      "summary": "The entry captures the texture of obsessive waiting, enumerating five women whose words are anticipated: \"Monica, Sonny, Aliza, Melissa, Kate. I am waiting for all these women's words.\" Sexual fantasies about Kate emerge in sensory detail: hands on arms, fantasized skin over fresh sheets, whispers and soft laughter. A third vaccine dose provides temporal grounding in the pandemic. Kate likes an Instagram photo, prompting the author to doubt whether it means anything at all. The pattern of reading significance into digital crumbs continues.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2022-01-20)",
          "scenes": [
            "Breathless Fantasy",
            "The Non-Jealousy Puzzle",
            "Reading Alex's Email",
            "Enumeration of Waiting",
            "Third Vaccine Dose",
            "Pharmacy Run",
            "The Vaccine Selfie"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-21.yaml",
      "date": "2022-01-21",
      "summary": "A crucial genealogy of romantic fixation is traced: \"I liked Kate because her accent reminded me of Flore, and I was infatuated with Flore because her face reminded me of Monica.\" This palimpsest of desire, where each woman carries traces of the previous, is a defining insight into the author's romantic patterns. A flirtatious text to Kate framed as cheating is sent and immediately regretted. The waiting for Aliza's response to the trans disclosure email creates anxiety, though the author suspects Aliza already knew. The entry reveals how romantic objects are never seen freshly but always through the lens of prior attachments.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-01-21)",
          "scenes": [
            "Flash-Forward Hook",
            "The Regretted Message",
            "The Unanswered Inbox",
            "The Wrong Productivity"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Writing (2022-01-21)",
          "scenes": [
            "The Dead Conversation",
            "The Genealogy Revelation",
            "Waiting for Disclosure's Echo",
            "Evening Fragments"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-23.yaml",
      "date": "2022-01-23",
      "summary": "Memories of Spain surface: vodka-lemon in Granada, dancing, a guide defending her. These fragments evoke an earlier chapter of life in Europe. A medication review is upcoming. The consideration of disclosing trans identity to a roommate becomes concrete: \"Do you know that I am trans?\" The question hangs unresolved. A fantasy emphasizes non-sexual intimacy: \"I just want to feel her close. Share the intimacy of dreaming together.\" A kitchen question about bliss surfaces as a memory within a memory.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2022-01-23)",
          "scenes": [
            "The Loneliness Question",
            "Rehearsing Disclosure",
            "The Dreaming Fantasy",
            "The Photos"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-24.yaml",
      "date": "2022-01-24",
      "summary": "A moment of clarity arrives: \"I am clearly not ready to be dating, be it casually or not.\" Dating apps are deleted. The author recognizes the pattern, connecting the current obsessive waiting to previous experiences with Molly and Flore. Self-compassion surfaces: \"These feelings are valid and human... They, like everything else bothering me right now, will eventually pass.\" Alex has a gender therapist appointment, connecting trans community networks. The entry shows the cycle of dating app engagement and withdrawal that characterizes this period.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2022-01-24)",
          "scenes": [
            "Writing Without Mentioning Her",
            "The Reckoning",
            "The Deletion",
            "Monica's Parallel Story",
            "The Pattern Surfaces",
            "Self-Compassion",
            "Taking Stock"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2022-01-24)",
          "scenes": [
            "The Community Thread",
            "The Screenshot to No One",
            "The Final Check"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-25.yaml",
      "date": "2022-01-25",
      "summary": "A rare moment of positive self-perception: \"If I didn't know it was me, I'd think the picture is of a pretty woman. I like my eyes and my hair.\" The dissociation required to see herself as beautiful—needing to forget it's her own image—reveals the complexity of trans self-acceptance. The question \"Is this what depression feels like?\" surfaces, suggesting uncertainty about her own emotional states. A therapy session with omissions, obsessive checking for messages from a woman she barely knows, and the self-interrogation: \"Why am I so needy? What am I looking for?\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "If I Didn",
          "scenes": [
            "The Anxiety Pendulum",
            "The Therapy Omission",
            "The Photoshoot",
            "The Conditional Beauty",
            "The Inbox Vigil"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "Remembering (2022-01-25)",
          "scenes": [
            "The Self-Interrogation",
            "The Depression Question"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-26.yaml",
      "date": "2022-01-26",
      "summary": "A crucial childhood memory surfaces: exploring the mother's closet and drawers when alone, trying on the nightgown in middle school. The shame persists: \"I feel disgusted even though - no, there was something wrong about it.\" The uncertainty about when leg shaving began reflects how trans memories often blur across time. First love is named as \"normalcy\" during the confusion of adolescence: \"She was my normalcy. Was I depressed before or after finally meeting her?\" Weight loss in high school emerges: \"I stopped eating. I stopped caring.\" These are origin memories for both trans identity and depression, intertwined in adolescent confusion.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "At Table (2022-01-26)",
          "scenes": [
            "First Love as Normalcy",
            "The Transformation"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Remembering (2022-01-26)",
          "scenes": [
            "Deleting the Story",
            "Crying Without Cause",
            "The Unanswerable Question"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-28.yaml",
      "date": "2022-01-28",
      "summary": "The cycle of obsession continues: deleting the number from contacts, yet still composing messages that will never be sent. The pattern of digital erasure as failed exorcism. A new match prompts trans disclosure, casually accepted, but attraction remains uncertain. Morning masturbation fantasizing about someone new, the body's needs separate from emotional fixation. New subletter arrives with painted nails, pronoun mix-ups sensed—queer possibility in the household. The self-hatred crystallizes: \"I keep thinking about Kate and I hate it. I hate me because of it.\" The recognition that flirtation became neediness, that coming on too strong killed whatever possibility existed. Watching stories, reacting then deleting the reaction, hoping she didn't notice. The possibility of hearing back grows dimmer and dimmer.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-01-28)",
          "scenes": [
            "Deleting the Number",
            "The Unanswered Questions",
            "Morning Masturbation",
            "New Match Responds"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Meeting (2022-01-28)",
          "scenes": [
            "The Subletter's Painted Nails",
            "The Self-Hatred Crystallizes",
            "Recognizing the Pattern",
            "Watching the Stories",
            "The Deleted Reaction"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-29.yaml",
      "date": "2022-01-29",
      "summary": "A boundary-setting message arrives in response to desperate text pleas: \"I've been feeling pressured.\" The transparency of Instagram stories about ghosting has backfired—she feels targeted. The narrator spirals into rambling apologies, aware of her excessive behavior but unable to stop. Crying upon seeing a friend's Snapchat reveals the raw emotional state. The entry closes with a crucial question: was this a hypomanic episode or just \"shitty behaviour?\" This psychiatric framing will deepen in coming months.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-01-29)",
          "scenes": [
            "Afternoon Tears",
            "The Question",
            "Deleted Evidence",
            "Hollow Hope"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-01-30.yaml",
      "date": "2022-01-30",
      "summary": "Kate's final message offers hollow hope: \"I will not forget about you!\" Yet the author continues seeking Kate's name in story view lists, unable to let go. A profound confession emerges: \"I am not normal. Not because I can't have sex like cis people - or other trans people.\" The abnormality lies elsewhere, in the attachment patterns themselves. The push-pull dynamic is articulated clearly: Sonny was pushed away when she showed interest, while Kate is obsessed over precisely because she is distant. The longing crystallizes: \"I wish I could find someone that feels to me the way I do about her.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Final Message Offers Hollow Hope",
          "scenes": [
            "Checking the View List",
            "The Afterthought That Mattered",
            "Rereading the Final Picture",
            "The Confession"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-02-06.yaml",
      "date": "2022-02-06",
      "summary": "The pre-transition photo is posted, and responses arrive: Carolina had a crush on him, Yomar too. Francisco thought he was a brother. These reactions reveal how the male version was perceived, adding texture to pre-transition life. The Euphoria quote captures the psychological pattern perfectly: \"I fall in love so easily because half of the relationship is in my head.\" This applies directly to the Kate obsession where fantasy outweighs reality. Helena is messaged, reaching back to Portugal memories. Kate continues watching stories without making contact, maintaining the asymmetric surveillance dynamic.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-02-06)",
          "scenes": [
            "Checking the Viewers",
            "Crush Confessions Arrive",
            "The Brother Question",
            "Jules' Therapy Quote"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-02-07.yaml",
      "date": "2022-02-07",
      "summary": "The masculine shame crystallizes with painful clarity: \"I feel like one of those guys that keep insisting on women.\" The persistence pattern is recognized as gendered, as male behavior she despises yet cannot stop. The pre-transition photo provides \"the gift of having an image to attribute to the masculine energy that stunk my interactions.\" Every interaction is catalogued in reverse chronology, the pathetic messages reviewed and dissected. Adderall and weed mixing reveals the substance use backdrop. The entry captures the horror of recognizing male patterns in oneself as a trans woman.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-02-07)",
          "scenes": [
            "1 AM Surveillance"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-02-08.yaml",
      "date": "2022-02-08",
      "summary": "A non-reply to a social media reaction triggers the core trans fear: \"She saw my own maleness and was disgusted; maybe she felt deceived.\" The terror of being clocked, of the male body being visible despite presentation, haunts every interaction. A significant memory surfaces: drinking in Spain to mute the urge to be a woman, using alcohol to suppress gender dysphoria before transition. A meta-awareness of the writing project emerges: \"I could tell all of my backstory as vignettes in a network of notes\" - prefiguring the very journal structure being analyzed. A TV show about alcoholism prompts the question of whether she has an alcohol problem.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2022-02-08)",
          "scenes": [
            "The Non-Reply",
            "The Living Room Session",
            "The Adoption Email",
            "Time Out of Joint",
            "The Dissociation",
            "The Dying Conversation",
            "The Spain Memory",
            "The Uncomfortable Recognition",
            "The Memoir Fantasy"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-02-11.yaml",
      "date": "2022-02-11",
      "summary": "A short entry that declines to fill the daily word count. The epigraph in Spanish captures the trans body fantasy with precision: wanting to be naked with someone, walking to bed without worrying about clothing coverage or facial hair, being told she's beautiful without doubt. This vision of unselfconscious intimacy, where the body can simply be without management or disclosure, distills the core longing. The brevity of the entry itself suggests exhaustion or resistance.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2022-02-11)",
          "scenes": [
            "Walking Under Snow",
            "The Nakedness Fantasy",
            "The Refusal"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-02-15.yaml",
      "date": "2022-02-15",
      "summary": "Extremely high, beyond even past experiences. A potential turning point: the obsessive story-watching is finally resisted, the surveillance loosening. A Tinder match asks a surprisingly insightful question about dealing with insecurity—the narrator feels seen by the question itself. Another match gives her phone number, seeking friends after ending a 3-year relationship. A therapy session addresses disappearing matches. The entry marks a possible transition away from obsessive fixation toward new connections.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Dreaming (2022-02-15)",
          "scenes": [
            "Vulnerability Epigraph",
            "Writing Gap",
            "Extreme High",
            "Disappearing Matches",
            "Friend's Observation"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2022-02-15)",
          "scenes": [
            "Valentine's Post",
            "Deleted Draft",
            "The Insecurity Question",
            "New Number",
            "Roommate's Boundary"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-02-16.yaml",
      "date": "2022-02-16",
      "summary": "A sexual picture exchange on Snapchat occurs before trans disclosure: \"I was too turned on to remember I hadn't told her I am trans.\" The arousal overrides the usual disclosure anxiety, revealing how desire can suspend the management of trans identity. Compliments are believed—\"good-girl nerdy vibes\"—and the schoolgirl costume fantasy emerges. The narrator sends a video reaching under underwear, intimacy escalating rapidly. Trans disclosure anxiety is postponed, the secret surviving another exchange.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2022-02-16)",
          "scenes": [
            "The Morning After"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-02-22.yaml",
      "date": "2022-02-22",
      "summary": "The catfisher dynamic is named explicitly. Trans disclosure to the catfisher: \"I did tell the catfisher I was trans. She didn't really mind.\" Despite suspecting she isn't real, sexual pictures continue. The core confession emerges: \"I'd rather be the target of strangers' lust than their jokes. If I am going to be dehumanized and seen as an object, I rather be one of desire than disgust.\" This is trans survival calculus articulated with brutal clarity. The catfisher's snap arrives: shirt bitten, breasts revealed, teeth like a feline or vampire. The fantasy intensifies: \"I imagined how it would feel to bleed by her fangs.\"",
      "problematic_scenes": [
        {
          "name": "Epigraph: The Secret",
          "description": "A disembodied confession about trans embodiment: \"I've been on hormones for years and I didn't know I could still get hard.\"",
          "reason": "contains colon"
        }
      ],
      "problematic_events": [
        {
          "name": "Despite Suspecting She Isn",
          "scenes": [
            "Validation Circuit",
            "The Confession",
            "The Dating List",
            "The App Cycle"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-02-26.yaml",
      "date": "2022-02-26",
      "summary": "Trans disclosure becomes a serial activity: multiple women receive the news, all accepting. The pattern of disclosure management emerges as routine rather than crisis. A new connection is noted as a lookalike of the therapist, the palimpsest pattern continuing: \"Bigger boobs, counting the ribs by looking, getting cut by her hip-bones.\" The physical description is precise and visceral. BDSM/kink discussions open new territories of sexual exploration while the narrator juggles multiple dating app connections.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Meeting (2022-02-26)",
          "scenes": [
            "Passing Confirmed",
            "Pre-Date Routine",
            "The Streak Continues"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-03-06.yaml",
      "date": "2022-03-06",
      "summary": "Kate-stalking persists through her friend's stories, generating jealousy. Emily posts \"Yes, I am real\" as a story, the catfisher question becoming explicit. A moment of brutal self-awareness surfaces: \"I am filling some void with these conversations. I am looking for something there, even though I am sure I won't find anything and end up hurting myself.\" The pattern is seen clearly yet continues. Katherine has broken up again. The entry closes with a lonely greeting: \"Hey lonely.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Stories Generating Jealousy Emily Posts",
          "scenes": [
            "Opening Question",
            "Lost Count",
            "The Red Circle",
            "Eleven Kilometers",
            "Yes, I Am Real",
            "The Birthday Loophole",
            "Accumulating Silences",
            "Void-Filling Confession",
            "Hey Lonely"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-03-11.yaml",
      "date": "2022-03-11",
      "summary": "A date unfolds as a three-act drama across a single day, culminating in sex. She tells her to her face she's pretty, observing specific details: \"the way I held my hand to my face and the small triangle formed above my eye with my loose lock of hair.\" The persistence pattern is validated: \"How I reached out to her multiple times was one of the reasons she was attracted to me.\" Sex includes oral, three fingers (a first), and attempted penetration with a condom that failed. Phimosis anxiety surfaces when she lowers the skin. The core revelation: \"My favourite part of the night, even more than the sex, was the two of us just lying naked on the bed holding each other.\" She leaves without spending the night.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Pretty Observing Specific Details",
          "scenes": [
            "Opening Quotations",
            "The Caffeteria Rendezvous",
            "The Walk",
            "The Fancy Empty Restaurant",
            "Being Told She's Pretty",
            "Persistence Validated",
            "The Blue Mask",
            "The Sex",
            "The Body's Betrayal",
            "The Condom Attempt",
            "Lying Together",
            "The Departure"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-03-13.yaml",
      "date": "2022-03-13",
      "summary": "A bar night generates jealousy when Gabriela (20) hits on Alda. Sending nudes to Emily from a bathroom stall serves as emotional displacement. A four-way kiss is attempted with Nico, Alda, and Gabriela, described as \"the most gay thing I can think of.\" Guilt emerges over desiring Gabriela: \"I wasn't much different to those strange men.\" The internal Spanish self-attack is linguistically revealing: \"Aceptalo, tio. Eres feo.\" - still using masculine address (\"tio\") in self-talk despite transition. Kate is finally unfollowed, a small act of letting go.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "I Wasn",
          "scenes": [
            "French Girl Detour",
            "The Unfollow"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-03-18.yaml",
      "date": "2022-03-18",
      "summary": "A date with a French woman (no attraction) prompts pattern recognition: \"There is something in me that gets invested in the other person as soon as I sit in front of them.\" The instant investment happens regardless of actual compatibility. A meta-question about the journal practice surfaces: \"Am I using this journal just to talk about the girls I see?\" The self-awareness about the writing's obsessive focus is notable. Despite resolving not to, a message is sent to a past date, demonstrating the gap between intention and compulsion.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-03-18)",
          "scenes": [
            "The Proposition",
            "Night Walk Home",
            "The Empty Restaurant",
            "The Greek Alphabet",
            "Instant Investment",
            "Time Lost"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Writing (2022-03-18)",
          "scenes": [
            "The Meta-Question",
            "Bumble BFF",
            "The Message Sent"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-03-25.yaml",
      "date": "2022-03-25",
      "summary": "The Alex date spans six hours from cafe to campus, culminating in a kiss scene rendered with striking synesthetic detail: \"I put my hand behind her neck instead of on her cheek. I played with two locks of curls, and it was as if I could feel their yellow in my fingertips.\" The sensation of color through touch captures intimacy's heightened perception. Meanwhile, an ex is removed as follower—another step in dismantling the obsession. An unexpected message arrives from a distant friend. A committee meeting goes positively, grounding the entry in academic life.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2022-03-25)",
          "scenes": [
            "Reflection on Writing",
            "Committee Meeting Afterglow"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-03-27.yaml",
      "date": "2022-03-27",
      "summary": "A date prompts self-aware observation: \"I was barely conscious of how my head was busy looking for flaws.\" The flaw-seeking behavior - looking for reasons to reject before being rejected - is named. A French accent triggers fear of repeating the ghosting/fixation cycle. Laser treatment marks transition progress. The date ends with a hug instead of a kiss, followed by texting multiple women with the phone facing down - performing indifference to the responses.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Walking (2022-03-27)",
          "scenes": [
            "Phone Facing Down"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-03-29.yaml",
      "date": "2022-03-29",
      "summary": "A laser treatment contract forces confrontation with official misgendering: \"Reading it hurt even more than the burning pulses under my skin.\" The administrative marking of the body as male inflicts pain beyond the physical procedure. Sensory memory of a past lover surfaces with visceral detail: \"I liked her taste and how it hurt when she pressed hard on my back and bit my neck.\" Dating numbness sets in amid multiple pursuits: \"I feel nothing. She could cancel, she could leave me stranded, and I wouldn't really care.\" A recent rejection echoes an earlier pattern, prompting resolve to disclose trans status before meeting anyone new.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-03-29)",
          "scenes": [
            "Dating Inventory",
            "The Sensory Memory",
            "The Disclosure Resolution",
            "The Email Exchange"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-04-04.yaml",
      "date": "2022-04-04",
      "summary": "Intimacy with Alexandra unfolds while watching The Worst Person in the World, the breathing synchronization captured: \"I forgot if it was my turn to inhale or exhale.\" Blanket cuddling progresses to a kiss: \"She lifted her face and I met her lips.\" Sensory detail follows: \"felt each of the fingers in her hand wrapping my breast.\" The breast sensation marks comfort with trans body during intimacy. The candidacy exam is scheduled for May 17th, anchoring academic timeline.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Walking (2022-04-04)",
          "scenes": [
            "Amanda Message",
            "Supervisor Disclosure",
            "Garden Growth"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-04-08.yaml",
      "date": "2022-04-08",
      "summary": "An 18km walk to Mont-Royal provides physical intimacy: arm-grabbing at the belvedere, a kiss at the end. She leaves for three months, prompting ambivalence. The uncertainty about whether grief is appropriate reveals emotional confusion. In therapy: \"I feel as if I'm distracting myself with these women, but from what?\" Past rejection memory surfaces. The core wound emerges: \"What is it with me that I am so easy to ignore?\"",
      "problematic_scenes": [
        {
          "name": "Epigraph: Ghosting Prophecy",
          "description": "\"Do you want to get coffee and at least put a face to the person we're gonna potentially end up ghosting anyway?\"",
          "reason": "contains colon"
        }
      ],
      "problematic_events": [
        {
          "name": "Remembering (2022-04-08)",
          "scenes": [
            "The Friend Request"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2022-04-08)",
          "scenes": [
            "The Departure",
            "Unanswered Messages",
            "Therapy Session",
            "The Core Question"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-06-12.yaml",
      "date": "2022-06-12",
      "summary": "A month without writing, then a scattered return: PhD candidacy achieved, Scotland trip imminent. The central insight reverses the drinking narrative: \"I use it to lose down the emotional block that keeps me from being aware of my own feelings\"—alcohol as emotional access, not numbing. The Dave Chappelle show triggers the weight of not being out to Alda. Multiple dates scheduled while asking: \"Am I using these girls as practice?\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Waiting (2022-06-12)",
          "scenes": [
            "The Dating Calendar",
            "Wine and No Food",
            "The Reversal Insight",
            "Chappelle on TV"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-07-19.yaml",
      "date": "2022-07-19",
      "summary": "Depression reduces the body to components: \"Estos dias soy solo piel y grasa y hueso.\" (These days I am only skin and fat and bone.) Self-harm emerges with ambiguous intention: \"I brushed the razor against my thigh. This time a very short but red streak appeared. It was unintentional, but that word feels like a lie.\" The lie of unintentionality is recognized in the moment. A woman met online stays the night, cries about a failed relationship, overstays. Approaching 30 triggers failure feelings. Dating apps are deleted again in the recurring cycle.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2022-07-19)",
          "scenes": [
            "The Vodka Dinner",
            "The Final Deletion",
            "The Overnight Guest",
            "The Overstay",
            "The Porcelain Speech",
            "The Moot Question"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-11-02.yaml",
      "date": "2022-11-02",
      "summary": "A shrooms experience yields insight about dating patterns: \"A desperate try to convince myself I am desirable. A non-awful non-unlovable person.\" The manic dependence is reframed as seeking external proof of lovability. Considering stopping medication while insurance covers hormones but not psych meds. A mother echo surfaces: \"Very similar to how my mom would scold me about pretending to be an idiot.\" The existential question emerges: \"What the fuck is it that I want?\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Remembering (2022-11-02)",
          "scenes": [
            "The Therapist's Reprimand",
            "Mother's Voice",
            "The Insurance Email"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2022-11-02)",
          "scenes": [
            "The Unanswered Texts",
            "What the Fuck Do I Want"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2022/2022-11-06.yaml",
      "date": "2022-11-06",
      "summary": "A brief meta-note about the writing practice itself: the tension between compulsion to write and absence of content captured in a single sentence. The entry's brevity embodies the very writer's block it describes—an urge that arrived and then departed, leaving only the paradox of needing to speak with nothing to say.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Brevity Embodies The Very Writer",
          "scenes": [
            "The Departed Urge",
            "The Paradox"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2023/2023-06-20.yaml",
      "date": "2023-06-20",
      "summary": "The Alexia night unfolds in exquisite detail. Meeting at Station Mont-Royal, walking to Le Darling for two beers in French. Arm-linking through empty Saint-Laurent. They pass the bench by McGill Gymnasium - \"the same bench where last year Alda asked me about my periods\" - and the narrator asks to sit. Hand on thigh. Silence. Then the disclosure: \"Je t'ai pas dit; je suis trans.\" \"Je savais pas.\" The brevity of the exchange is perfect. Then the kiss - one, two, three, seven times, counted. 2am. Home. Sex. \"She asked me to go plus doucement. I found the perfect rhythm.\" The narrator didn't finish but found pleasure in her caresses. Morning kisses. \"Je peux te voire encore.\" Three goodbye kisses. The contrast with the Quebecoise girl who deleted after sex adds post-sex abandonment context.",
      "problematic_scenes": [
        {
          "name": "The Failed Date (Flashback)",
          "description": "Yesterday with someone else. Walking the mountain. A condescending remark triggers a switch. Nothing will come of this one. They separate in the park and never reach out again.",
          "reason": "contains parentheses"
        }
      ],
      "problematic_events": [
        {
          "name": "The Narrator Didn",
          "scenes": [
            "Morning Under Covers",
            "Three Goodbye Kisses",
            "The Screenshot"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2023/2023-06-27.yaml",
      "date": "2023-06-27",
      "summary": "A weekend with trans women friends from San Diego prompts direct confrontation with surgical possibilities. One describes her SRS in clinical detail: orchiectomy, penile inversion, vulva construction. The narrator sees post-op results. When asked if surgery is something she wants: \"I told her that I did not know. After seeing Cynthia's brand-new vulva, I knew even less.\" Ambivalence deepens rather than resolves. Walking with visibly trans women triggers clocking anxiety: \"Am I read as trans in mine?\" Meanwhile, moving plans finalize: \"I will probably end up moving out without ever telling her about me.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2023-06-27)",
          "scenes": [
            "Moving Out Without Telling"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2023/2023-06-29.yaml",
      "date": "2023-06-29",
      "summary": "A queer happy hour proves disappointing—clique dynamics mirror conference anxieties. The narrator watches solo arrivals eventually find conversation while she remains in her booth. A friend's visit is planned for the narrator's birthday. Past romantic entanglements surface when a tweet triggers the three-way kiss story. The medication stoppage theme resurfaces in a walking confession. The core emptiness is articulated: \"Am I feeling better? For months, I have not written anything. I feel empty inside; both my body and my mind.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Visit Is Planned For The Narrator",
          "scenes": [
            "The Last Walk Home"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-01-28.yaml",
      "date": "2024-01-28",
      "summary": "The Sophie saga begins with a December meeting at Bar Pamplemousse, a brief 5 a 7 before her concert. The entry recounts the familiar pattern: initial connection, tentative planning, then cancellation when Sophie's cat vomits blood. Messages stay unread, triggering obsessive monitoring. The Alexandra memory surfaces - kissed goodbye twice, never seen again - connecting to the broader pattern of vanishing women. The regret crystallizes: \"I keep fighting the urge to tell her how I am starting to regret not asking to kiss her.\" The Kate echo is already visible beneath the Sophie surface.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Waiting (2024-01-28)",
          "scenes": [
            "The Unanswered Texts",
            "Four Texts Too Many"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-01-29.yaml",
      "date": "2024-01-29",
      "summary": "Reading old journal entries reveals the pattern explicitly: the same dynamics repeating with different faces across years. French class struggles continue. A significant intimate arrangement emerges: masturbating while the other showers. Then the devastating confession: \"With Monica, I felt a similar unbearable urge that I could barely contain until the moment of her departure. Instead of touching myself, it was to cut my thighs.\" The parallel is stark—with one person the urge is sexual, with another it was self-harm. The body expressing different attachments differently.",
      "problematic_scenes": [
        {
          "name": "The Friend's Visit (Flashback)",
          "description": "Airport pickup, groceries, movies on the couch, restaurants, lying in the same bed chatting—all with an un-trespassable barrier.",
          "reason": "contains parentheses"
        }
      ],
      "problematic_events": [
        {
          "name": "Writing (2024-01-29)",
          "scenes": [
            "The Archive at 1 AM",
            "Late-Night Conversation"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2024-01-29)",
          "scenes": [
            "The Shower Arrangement",
            "The Confession",
            "The Fear Named"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-02-01.yaml",
      "date": "2024-02-01",
      "summary": "The reaching-out text to Sophie is sent at 6:50am, ending the waiting game. The recognition follows: \"Now, I will never know if given enough time she had reached out.\" By reaching out first, the author forecloses knowing if Sophie would have initiated. The trans non-disclosure to Sophie is noted. Watching Lovesick with Sonny provides domestic texture. The entry marks the transition from waiting to having acted.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-02-01)",
          "scenes": [
            "The Unsent Message"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Meeting (2024-02-01)",
          "scenes": [
            "The Text Sent",
            "The Unsaid Thing",
            "31 Minutes and Counting"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-02-03.yaml",
      "date": "2024-02-03",
      "summary": "A vintage camera purchase punctuates days of domestic routine. The long-awaited response finally arrives: \"would love to see you.\" The narrator avoids reading it, dreading rejection even as the phone buzzes. Sonny reads it first, then convinces her to look. Relief doesn't come—only new anxiety about what to say next, the pattern of wanting contact but fearing what it demands. Friends intervene: reply now, not tomorrow.",
      "problematic_scenes": [
        {
          "name": "The Marketplace Find (Flashback)",
          "description": "At the lab, the vintage camera ad appears for $35. Screenshots to Sonny, negotiations with the seller between meetings with prospective students.",
          "reason": "contains parentheses"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2024/2024-02-04.yaml",
      "date": "2024-02-04",
      "summary": "A Sunday of solitude punctuated by social obligation. Sister goes to Mass, leaving the narrator to masturbate under the covers, facing the wall. The stains discovered later bring disgust that fades quickly. The hope that a woman from Hinge will reach out diminishes each day. A brunch crawl through Montreal restaurants with friends provides distraction, but French still makes him feel stupid. By evening, half a poutine eaten, he gives up on the day.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "At Table (2024-02-04)",
          "scenes": [
            "Half-Eaten Surrender"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-02-05.yaml",
      "date": "2024-02-05",
      "summary": "Cuba photo scans arrive disappointing. Organizing old photos in Google becomes an archaeological experience: watching the body change through the years. \"Being thinner and thinner after breaking up with Catherine. Gaining weight after moving to DC... My hair would get longer and longer until it became short.\" The epigraph distills the loss: \"I miss my body.\" Reading old rejection texts triggers despair. French class is unbearable. The cyclical nature is recognized: \"I'm at the exact same spot I was two years ago.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-02-05)",
          "scenes": [
            "Screenshots of Rejection",
            "French Class Breakdown",
            "The Texting Paradox",
            "The Instagram Incident",
            "Crying After Class"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-02-11.yaml",
      "date": "2024-02-11",
      "summary": "Sonny departs and the house empties. Sophie proposes meeting on Valentine's Day to see the Cuba photos. A small victory: \"For the first time since I could remember, I stopped waiting for a notification.\" The final days compress: shopping, cinema, goodbyes, airport. Then the longest commute home. The weekend collapses into isolation and the core wound surfaces: \"I worry I will meet with her, but I won't be enough.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Day To See The Cuba Photos",
          "scenes": [
            "The Empty House"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "T Be Enough",
          "scenes": [
            "Pedro's Challenge",
            "Outlet Shopping",
            "Dinner and Drinks",
            "Waiting for the Bus",
            "The Locked Door"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "Waiting (2024-02-11)",
          "scenes": [
            "The Notification",
            "La vie revee",
            "Kung Pao Chicken"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-02-13.yaml",
      "date": "2024-02-13",
      "summary": "ChatGPT provides harsh advice about Sophie's behavior as epigraph. Changing sheets means losing Sonny's scent: \"This time I did not worry about losing the faint smell of the presence of Sonny like I did with Monica's.\" The comparison reveals different weights of attachment - Sonny's presence is less anxiously guarded than Monica's was. Planning to play We're Not Really Strangers with Alda. The confession: \"Lately, I have been craving intimacy.\"",
      "problematic_scenes": [
        {
          "name": "INT. BEDROOM - 1-2 AM",
          "description": "He turns on the night light and retrieves clean sheets unused during Sonny's month-long stay. Changing bedding without the anxiety that accompanied erasing Monica's scent.",
          "reason": "screenwriting format (INT./EXT.)"
        },
        {
          "name": "INT. BEDROOM - EARLY MORNING",
          "description": "Internal battle - stay home or meet Louis. The weather app won't load. He traces the failure to a knocked-out plug - sheets thrown carelessly last night.",
          "reason": "screenwriting format (INT./EXT.)"
        },
        {
          "name": "INT. KITCHEN/DESK - 10 AM",
          "description": "Coffee, work, a 20-minute Teams call with Louis.",
          "reason": "screenwriting format (INT./EXT.)"
        },
        {
          "name": "INT. KITCHEN - NOON",
          "description": "Eggs and ham. A late breakfast cooked solo.",
          "reason": "screenwriting format (INT./EXT.)"
        },
        {
          "name": "FLASHBACK: EXT. PARC LA FONTAINE - YEARS AGO",
          "description": "Laura, the Colombian exchange student. Film cameras. A roll left undeveloped for years. She posted about the card game on Instagram.",
          "reason": "contains colon; flashback prefix with colon"
        },
        {
          "name": "INT. APARTMENT - FRENCH CLASS",
          "description": "Focus deteriorating. This time he waits until class ends to write.",
          "reason": "screenwriting format (INT./EXT.)"
        },
        {
          "name": "INT. APARTMENT - EVENING",
          "description": "The texting dilemma. Sophie or Tirza? He always reaches out to Tirza when disillusioned with Sophie. \"I know what I should do, but I don't know if I can.\"",
          "reason": "screenwriting format (INT./EXT.)"
        }
      ],
      "problematic_events": [
        {
          "name": "S Was Planning To Play We",
          "scenes": [
            "INT. BEDROOM - 1-2 AM",
            "INT. BEDROOM - EARLY MORNING",
            "INT. KITCHEN/DESK - 10 AM",
            "INT. KITCHEN - NOON"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "Writing (2024-02-13)",
          "scenes": [
            "The Redirected Game",
            "INT. APARTMENT - FRENCH CLASS",
            "INT. APARTMENT - EVENING"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-02-14.yaml",
      "date": "2024-02-14",
      "summary": "Valentine's Day date with Sophie at Thomson House. Cuba photos are shown but Sophie seems rushed. A promise to meet after her Ottawa trip. The suspicious reading: \"Part of me suspects this whole meeting was just an attempt to placate my insistence.\" The narrator wants to kiss her but cannot let it out. The parallel emerges: \"I am not sure why I feel this deep urge to start crying, but, like my request to kiss her, I just can't let it out.\" Both the desire and the grief are suppressed identically.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "T Let It Out",
          "scenes": [
            "Corner Table at Thomson House"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "Messaging (2024-02-14)",
          "scenes": [
            "The Reluctant Text",
            "Beans and Personal Scent"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Meeting (2024-02-14)",
          "scenes": [
            "The Phone in the Dark",
            "The Archived Conversation",
            "Morning Arrangements",
            "The Tirza Draft"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Waiting (2024-02-14)",
          "scenes": [
            "Showing the Cuba Photos",
            "The Placation Suspicion",
            "Tirza's Reply",
            "Sophie's Diplomacy Text",
            "The Suppressed Cry"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-02-16.yaml",
      "date": "2024-02-16",
      "summary": "Playing We're Not Really Strangers with Alda deepens their friendship through three levels of increasingly personal questions. They call Sonny during the game, triangulating the support network. The night ends with puking twice from heavy drinking. In the morning, a spontaneous text to Sophie before her trip is gently declined, continuing the pattern of reaching out and being rebuffed.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2024-02-16)",
          "scenes": [
            "Calling in Sick",
            "Drifting Through One Day",
            "Beer and Memory",
            "The Red Box Opens",
            "Perception, Connection, Reflection",
            "Calling Someone You Admire",
            "The Note Set Aside",
            "IGA Interlude",
            "The Body's Reckoning",
            "Drunk Drafting",
            "No Hearts This Time"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-02-18.yaml",
      "date": "2024-02-18",
      "summary": "Irish pub with a friend provides space for her relationship troubles. Reading old journal entries (the Kate era, the Amanda date) triggers body nostalgia: \"I weighted 70 kg when I went to Puerto Vallarta... I like the way I looked. I was quite attractive. I had no reason to be this insecure.\" Current body hatred follows: \"My face contorts in weird ways. My mouth moves strangely. My neck is too thick.\" The future projection is self-aware: \"Do I have a reason to feel unattractive now, or will I look back to these pictures with nostalgia?\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Walking (2024-02-18)",
          "scenes": [
            "Planning the Week",
            "The Grocery Run",
            "The Archive Opens",
            "Body Nostalgia Spiral",
            "The Present Rejection",
            "The Future Question"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-01.yaml",
      "date": "2024-03-01",
      "summary": "Hungover and nauseous, the narrator breaks her promise by texting Sophie, then deletes the conversation again. \"Life is the stuff that happens while I wait for a stupid text.\" She moves through a lab lunch in silence, wanting to sleep right there, then isolates herself at home watching Before Midnight and La La Land. Mia's speech about not being enough makes her cry. She drafts imaginary dates—trauma bonding drinking games, the brunch that never happened—manufacturing connection in her head while waiting for a reply that may never come.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Walking (2024-03-01)",
          "scenes": [
            "The Morning After",
            "The Broken Promise",
            "Coffee and Unfinished Films",
            "First at the Restaurant",
            "Shutdown at Lunch",
            "The Silent Walk",
            "Avoiding Colleagues"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Waiting (2024-03-01)",
          "scenes": [
            "Before Sunset",
            "Not Being Enough",
            "Waiting for the Text",
            "Date Drafts"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-03.yaml",
      "date": "2024-03-03",
      "summary": "Nuit blanche with Aliza at Lili & Oli cafe in Verdun. Most contacts are deleted from the phone, including Sophie, but the number stays memorized: \"Nine. Seven. Four.\" The deletion is symbolic while the connection persists. Looking at toddlers in the cafe triggers motherhood grief: \"I looked at them and it hurt. I thought about children and motherhood. I felt the hole in my future that would never be filled.\" The trans-specific loss of biological motherhood crystallizes in a coffee shop.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-03-03)",
          "scenes": [
            "The Contact Purge",
            "Nine. Seven. Four.",
            "Working with Aliza",
            "The Toddlers",
            "Dad's Message"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-04.yaml",
      "date": "2024-03-04",
      "summary": "Restless wandering through Villeray, unable to stay inside. At a cafe, the narrator recognizes a past date whose name she'd forgotten—a ghost among many. Meanwhile, editing old journal entries from two years prior reveals the same obsessive pattern repeating. The archive confronts her with her own loops.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Meeting (2024-03-04)",
          "scenes": [
            "Editing the Archive",
            "21h28"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-05.yaml",
      "date": "2024-03-05",
      "summary": "The text is sent, the blue heart comes back. A vulnerable reach-out from bed at 8h20, the phone pushed away, the refusal to check until after showering. She accepts. The day unfolds in lab routine and small talk, but the real drama is internal: the anticipatory tension before meeting her, the disclosure anxiety. Evening spent watching Before Sunrise and Before Sunset—romantic films about fleeting connection and time running out.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Walking (2024-03-05)",
          "scenes": [
            "The Message at 8h20",
            "The Blue Heart",
            "Morning Commute",
            "Lab Chatter",
            "The Prospective Student",
            "The Small Lie"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Waiting (2024-03-05)",
          "scenes": [
            "Before Sunrise",
            "Before Sunset"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-06.yaml",
      "date": "2024-03-06",
      "summary": "The Euphoria quote resurfaces: \"I fall in love so easily because half of the relationship is in my head.\" Revisiting 2022 journal entries during French class, the narrator recognizes the pattern continuing two years later. The upcoming third date brings disclosure anxiety—nervous about saying \"I am trans\" and watching her reaction. A psychiatrist appointment looms with its own fears: the temptation to lie, to quit medication, to question the diagnosis itself.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2024-03-06)",
          "scenes": [
            "Morning Paralysis",
            "Scripts Running",
            "Excavating 2022",
            "The Question Without Answer",
            "Rehearsing the Psychiatrist",
            "Friends Discussing Dating"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2024-03-06)",
          "scenes": [
            "The Third Date Confirmed"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-10.yaml",
      "date": "2024-03-10",
      "summary": "Post-date processing begins. She texts after a lovely night, no response arrives. A social gathering provides distraction but the outsider feeling persists. The sleeping pill fails at 3am. A past rejection surfaces: counting dates to the end like a formula.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "At Table (2024-03-10)",
          "scenes": [
            "Kitchen, Sunday afternoon"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2024-03-10)",
          "scenes": [
            "Saturday morning, apartment",
            "Saturday, couch",
            "Phone in hand",
            "The text sent",
            "Phone, later"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Dreaming (2024-03-10)",
          "scenes": [
            "3am waking",
            "Sunday, still in pajamas"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-12.yaml",
      "date": "2024-03-12",
      "summary": "Fumigation displaces the narrator into the city. At the café, working through 2015 journals triggers depression—the weight of September that year, the deadname restored to the text. A friend's appreciation for shared entries leads to offering more: past romantic encounters becoming gifts. Evening brings medication and fantasizing about texting someone she shouldn't. The epigraph cuts: loving how easily you can cut something off and feel nothing.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2024-03-12)",
          "scenes": [
            "Reorganizing with Headphones",
            "The Archive as Gift",
            "Class Through a Screen",
            "The Awful Idea"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-13.yaml",
      "date": "2024-03-13",
      "summary": "An unexpected text arrives from someone thought lost. The narrator moves through a day of meetings where her research goes unpraised, terminal code flashing impressively for colleagues while she downplays it. The entry ends falling asleep before French class, \"enumerating to myself the reasons why I do and don't expect Sophie to reach out ever again\" - the obsessive cataloging of hope and despair.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "At Table (2024-03-13)",
          "scenes": [
            "Liminal Sleep",
            "The Weigh-In",
            "Croissant Amandes",
            "The Empty Corridor"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-14.yaml",
      "date": "2024-03-14",
      "summary": "Thomson House journaling session after Aliza leaves, watching strangers and describing them in intimate detail—the blonde girl with red eyeglasses, hands playing with the table edge. The narrator questions why she describes strangers, connecting it to street photography and observation. First session with new therapist goes well; trans identity mentioned in passing with no notable reaction from either party. The pivotal line emerges: \"I've transitioned for almost 8 years now. I've been a woman for almost a third of my life.\" The narrator dreads ending things with previous therapist to avoid repeating the two-therapists situation from years before. The epigraph reveals a meta-insight about ADHD and alcohol: the paradoxical effects of stimulants mirrored by repressive nature and disinhibition.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Waiting (2024-03-14)",
          "scenes": [
            "Staring is Rude",
            "Two Pints In"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-16.yaml",
      "date": "2024-03-16",
      "summary": "Love Lies Bleeding at the cinema—the theater full of queer women prompting the essential question: \"How did I know they were queer? What was it that gave me the idea these women are like me?\" The friend loves the violent lesbian romance more than the narrator, who gets annoyed by the characters' impulsive decisions. Her comment at film's end: \"I won't settle for anything less.\" The Saint Patrick's bar crawl unfolds—multiple rounds of Jameson, the superstition about eye contact during toasts bringing seven years of bad sex. The narrator's confession emerges: \"I think I prefer bad sex over no sex.\" The first time wearing the dark denim jacket since Cuba; makeup applied but feeling fake despite the better-matched foundation.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "I Won",
          "scenes": [
            "Chugging Cider at Thomson's",
            "The Convenience Store Detour",
            "Queer Recognition",
            "Love Lies Bleeding",
            "I Won't Settle for Anything Less"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "S Confession Emerges",
          "scenes": [
            "Pizza Ordered"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-17.yaml",
      "date": "2024-03-17",
      "summary": "A day of domestic stasis and dread. The narrator stays in bed until morning ends, watch vibrating with messages—Cuba photos, father's portrait, an abacus instead of the expected cat. The poutine t-shirt purchased at a souvenir shop triggers sudden memory: \"Just now am I realizing that I bought this shirt with Monica.\" Reading Honey Girl at the laundromat—the astronomer marrying a stranger—provokes the melancholic observation: \"It makes me think of what I don't have.\" Weight over 79kg but still three eggs cooked. The urge to buy vodka resisted, the craving for alcohol documented. Tomorrow's therapy appointment looms: \"I dread last sessions. I hate closures.\" The pattern of avoiding therapeutic endings traced back years before.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "T Have",
          "scenes": [
            "Morning in Bed",
            "The Poutine T-Shirt",
            "Deleting Without Opening",
            "Grocery Run",
            "79 Kilograms",
            "Resisting the Bottle"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "S Therapy Appointment Looms",
          "scenes": [
            "The Laundromat",
            "Reading Honey Girl",
            "The Wrong Dryer",
            "Exporting the Year",
            "Dreading Tomorrow"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-18.yaml",
      "date": "2024-03-18",
      "summary": "Session with Calli that was not supposed to be the last—the narrator never mentions starting with another counselor. The accidental dish-cut on the wrist stings \"in a familiar way,\" prompting Calli's therapeutic probe: \"Did it remind you of cutting yourself in a different way?\" The thin scarlet line becomes object of obsessive glancing in the waiting room. Calli introduces the crystal ball exercise: imagine knowing Sophie will continue with occasional encounters and intermittent communication for six months. The narrator articulates the central anxiety: \"I hate the idea that I am chasing her. In order to chase something, it means it's running away from you.\" Vodka purchased and consumed starting at 15h despite previous resistance. Alda receives a journal entry and responds with the meta-prophecy: \"This should be the start of your book.\"",
      "problematic_scenes": [
        {
          "name": "Therapy: The Wound",
          "description": "Mentioning yesterday's cut to the therapist; \"Did it remind you of cutting yourself in a different way?\"",
          "reason": "contains colon"
        },
        {
          "name": "Therapy: The Crystal Ball",
          "description": "Imagine knowing this will continue for six months—occasional encounters, intermittent communication. How does that feel?",
          "reason": "contains colon"
        },
        {
          "name": "Therapy: The Chase",
          "description": "\"I hate the idea that I am chasing her. In order to chase something, it means it's running away from you.\" The therapist challenges: sometimes chasing is play.",
          "reason": "contains colon"
        }
      ],
      "problematic_events": [
        {
          "name": "S Therapeutic Probe",
          "scenes": [
            "The Walk Downhill",
            "The Shopping Trip",
            "Drinking Alone at 15h",
            "This Should Be the Start of Your Book"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "S Running Away From You",
          "scenes": [
            "French Class Overtime"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-20.yaml",
      "date": "2024-03-20",
      "summary": "The BODY entry. A vivid period dream: blood transpiring through underwear and shorts to the sheets, mother asking \"Sofía, are you getting your period?\" The dreamer's anguished response: \"How would I be getting a period? I don't have a uterus... I don't even have a vagina!\" Therapy session explores the motherhood wound explicitly connected to transition: \"Before transitioning, I never imagined myself as a parent. I realized later that it had to do with me not ever wanting to be a dad. Now, more than a decade later, I feel heartbroken with the news of people I know having kids.\" Self-harm history disclosed—the first cut years ago in Madrid, the recent one triggered by French class homework requiring childhood photos to compare with current appearance. At the academic conference, the narrator sees herself in the elevator mirror. \"I hated what I saw. I hated my clothes and the way my body looked in them... I didn't just feel fat. I felt unattractive.\"",
      "problematic_scenes": [
        {
          "name": "Therapy Session: The Motherhood Wound",
          "description": "Dreams disclosed—the period dream, the pregnancy dream from years ago. The explicit articulation: before transitioning, never wanting to be a dad; now heartbroken watching toddlers in cafés.",
          "reason": "contains colon"
        },
        {
          "name": "Reception: The Unheard Voice",
          "description": "Red wine. The familiar moments where she says something nobody hears. Speaking the least at the whole table.",
          "reason": "contains colon"
        }
      ],
      "problematic_events": [
        {
          "name": "S Anguished Response",
          "scenes": [
            "The Period Dream",
            "Therapy Session: The Motherhood Wound",
            "Self-Harm History"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "T Have A Uterus I Don",
          "scenes": [
            "Conference Registration, 7h30",
            "The Elevator Mirror",
            "Eating More Than Any Day This Year",
            "Not Belonging"
          ],
          "reason": "starts with single letter T/S (likely truncated); ends with incomplete contraction (truncated)"
        },
        {
          "name": "T Just Feel Fat I Felt Unattractive",
          "scenes": [
            "The Language Shift",
            "Reception: The Unheard Voice",
            "Pub with a Friend",
            "Fast Food for Medication"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-24.yaml",
      "date": "2024-03-24",
      "summary": "The DISTRACTION LIST entry. The narrator compiles a list of people to text instead of the current fixation: \"Kath, Valerie, Max, Monica, Heloise. Now, Sophie.\" The strategy is explicit—earn the right to text her by first reaching out to the ghosts. One responds with flirtation; another with news of burnout leave. The most devastating response catalogs the narrator's perceived coldness during a past visit: \"I felt unwelcome and yet I missed you very very much these months and it still hurts.\" A friend breaks up with her girlfriend in the background. The narrator drafts but doesn't send the meta-text revealing the whole strategy. A confidant offers hope: \"I think she likes you.\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Perceived Coldness During A Past Visit",
          "scenes": [
            "The Blur of Days"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "Messaging (2024-03-24)",
          "scenes": [
            "Morning at the Bakery",
            "Back to Bed",
            "The Flirty Thread Discovered",
            "Executing the List",
            "The Devastating Response",
            "The Text Not Sent"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-25.yaml",
      "date": "2024-03-25",
      "summary": "The Monica SELF-HARM DISCLOSURE entry. The narrator responds to Monica's message cataloging hurt, explaining how Monica brings out the worst in her: \"I hate myself more when I'm around you, sometimes even after we talk.\" The crucial disclosure emerges: \"I told her... the day she left was the last time I cut myself.\" The narrator hesitates to make the connection explicit, knowing it's cruel, aware that \"the rest of the times I did it before, it had nothing to do with her.\" Monica's questions arrive—why only with her? how has she hurt the narrator?—and the narrator develops the idea of how Monica brings out the worst: the interrupting, talking over, all happening only with her. The Barbara Pravi epigraph frames the entry: \"Je veux qu'on m'aime, parce que moi, je sais pas bien aimer mes contours.\" The narrator finishes her vodka and heads to bed.",
      "problematic_scenes": [
        {
          "name": "The Night Before (Flashback)",
          "description": "Composing the message to Monica. Explaining how she brings out the worst. Suggesting ending the friendship. Archiving the conversation to avoid seeing the response.",
          "reason": "contains parentheses"
        },
        {
          "name": "The Lab Meeting (Teams)",
          "description": "Webcam off. The narrator the only one not physically at MNI. Alfonso presenting on CSF biomarkers, his accent thickening with nerves. The narrator noticing everything except the science. Wondering if Louis noticed her absence.",
          "reason": "contains parentheses"
        }
      ],
      "problematic_events": [
        {
          "name": "S Cruel Aware That",
          "scenes": [
            "The Night Before (Flashback)",
            "Drinking Alone"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-26.yaml",
      "date": "2024-03-26",
      "summary": "The FIRST KISS / PRE-TRANSITION entry. Therapy session bridges two subjects: ending the connection with one crush, dreading no connection will start with another. When asked to describe her old friend, the narrator blanks completely: \"She felt so far away and untouchable that for a minute I might have even forgotten her face.\" The crying comes in waves, emptying. The crucial revelation: the old friend was the first kiss, their relationship not always Platonic. The therapist notices: \"Ese es un detalle importante.\" The deeper insight emerges: \"Other than my family, I don't have any other connection to my life as a man.\" The narrator catalogs disappeared friendships from high school and college—none of whose names came up as potential people to reach out to. The stench of an old man at the metro station follows her across the city: \"Maybe I deserve it.\"",
      "problematic_scenes": [
        {
          "name": "After Session: Makeup, Movement",
          "description": "Putting on makeup, heading out to work. Transition as continuous assembly.",
          "reason": "contains colon"
        }
      ],
      "problematic_events": [
        {
          "name": "Other Than My Family I Don",
          "scenes": [
            "Pharmacy Routine",
            "Bakery, Kindle Untouched",
            "Therapist's Opening Question",
            "Two Subjects, One Hour",
            "The Crush Summarized",
            "The Defense Mechanism Revealed",
            "The Old Friend Named",
            "Asked to Describe Her",
            "Crying Until Empty",
            "The Crucial Revelation",
            "The Bridge Between Subjects",
            "The Catalog of the Disappeared",
            "After Session: Makeup, Movement"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-03-30.yaml",
      "date": "2024-03-30",
      "summary": "The DEADNAME DREAM entry. Sleep paralysis with DC characters and psychological trauma, followed by the motherhood/deadname dream: \"It had something to do with having my kids—me not being able to—and my mother somehow being unsupportive of my transition. She used my deadname in the dream.\" Monica as the last person to say it aloud, unfamiliar with the faux pas. Jay match on Tinder—casual sex in mind—prompts the trans disclosure and her question about what that means sexually. Mid-conversation, Sophie's notification appears: \"Hey! I did not—to be honest I have not been doing super well physically since—\" The narrator screenshots the cat avatar immediately but cannot bring herself to open the full message. Dancing at the rock bar with Aliza and Liana. The entry ends with the central contradiction: \"Why am I so scared of reading her rejection if I was more than ready to drink tomorrow for the occasion of letting her go?\"",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Notification Appears",
          "scenes": [
            "Racing the Clock",
            "Sleep Paralysis Theater",
            "The Motherhood Dream",
            "The Last to Say It"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "Messaging (2024-03-30)",
          "scenes": [
            "Noon Without Coffee",
            "Jay's Good Times",
            "The Disclosure",
            "The Cat Notification"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-04.yaml",
      "date": "2024-04-04",
      "summary": "The DISCLOSURE CATALOG entry. After Sophie's rejection, the narrator systematically comes out to dating app matches—Jay, Kayla, Marie-Anne, Eva, Gabrielle, Sy, Typhaine—each response varying from acceptance to ghosting. The Gabrielle exchange becomes psychologically pivotal: she asks to hear the narrator's voice to judge if she can be attracted to a trans woman. The narrator refuses: \"I didn't want to put myself through feeling inspected or risking not being woman enough.\" This refusal articulates a boundary against the femininity-inspection ritual that trans women face. The entry documents the exhausting labor of repeated disclosure—each time explaining, each time risking rejection, each time hoping the answer comes quickly rather than in the agonizing hours of waiting.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-04-04)",
          "scenes": [
            "The Unopened Notification",
            "Amaretto Sunday",
            "The Verdict"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-06.yaml",
      "date": "2024-04-06",
      "summary": "The SELF-INJECTION entry. The pharmacy gave the narrator half her estrogen prescription—a clerical error she cannot bring herself to correct. She faces the choice: ration the pills or revive the practice of self-injection from three years ago. Choosing the needle: \"I gave myself a shot today... There is this strange feeling in my thigh right now that somehow feels nostalgic.\" The body remembering the old ritual, muscle memory of transition's earlier phase. Between medical appointments and lab meetings, she processes the previous day's voice-message rejection with a friend, then secures a date for tomorrow. The HRT anxiety—counting pills, calculating doses, the inability to advocate at the pharmacy counter—prefigures the medication precarity that will intensify.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Remembering (2024-04-06)",
          "scenes": [
            "The Needle Returns",
            "Counting Pills"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-07.yaml",
      "date": "2024-04-07",
      "summary": "First date with Marie-Anne at a cafe and Parc Jarry. The conversation flows mostly in English; the narrator offers to switch to French whenever she struggles—an echo of the linguistic dynamic with a past lover. A child approaches mid-conversation and asks if the narrator is American; the mother explains it's the accent. Being perceived as foreign: the layers of identity stacking visibly. The date ends with a hug and Instagram exchange, pleasant but without spark. She leaves for three weeks. The anticipation of waiting returns.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-04-07)",
          "scenes": [
            "Dressing Without Confidence",
            "The Broken Glass",
            "Wanting to Arrive Second",
            "Walking to the Cafe"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-08.yaml",
      "date": "2024-04-08",
      "summary": "The WOMAN ENOUGH entry. Final session with therapist after three years. The narrator speaks about a potential date's voice-message request: \"I don't wanna put myself through having to prove I am woman enough for anybody.\" The closing intervention brings tears: \"When you say how I am enough, the first thought that crosses my mind is 'I know.' But, honestly—\" \"You don't fully believe it.\" \"No.\" The core wound articulated: knowing intellectually while not believing emotionally. Afterwards, the narrator watches the solar eclipse with a friend at the mountain lake—the sky darkening, the world briefly paused. A flirtation intensifies; summer trip to Mexico City takes shape. The transition from one therapist to another marks a threshold.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Voice-Message Request",
          "scenes": [
            "Medication Experiments",
            "4am Wakefulness",
            "Morning Preparation",
            "Walk to the Session"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "You Don",
          "scenes": [
            "Meeting at the Old Building",
            "Eclipse Supplies",
            "Waiting for Totality",
            "The Eclipse"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "The How (2024-04-08-3)",
          "scenes": [
            "Missed Experiences",
            "Summer Plans Take Shape",
            "Evening Side Effects"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-09.yaml",
      "date": "2024-04-09",
      "summary": "Flirty Tinder banter with Marie about scary movies and making out on couches. The narrator discloses being trans mid-flirtation, the language calibrated for casual delivery: \"Talking about what we aren't, unless we get to third base it wouldn't make much of a difference, but I'm trans FYI—no need to get awkward if it's a deal-breaker.\" Marie responds warmly: \"It's absolutely not a deal breaker, don't worry bb.\" The relief of acceptance, quickly absorbed, the pattern continuing. Therapy session explores insomnia and the lingering ghost of a recently ended situation—persisting even as new matches accumulate.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Talking About What We Aren",
          "scenes": [
            "3am Wakefulness",
            "Morning in Bed with Tinder",
            "Timezone Confusion",
            "Coffee Before Session"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "T Make Much Of A Difference But",
          "scenes": [
            "The Movie Negotiation",
            "The Disclosure",
            "Therapy Session",
            "The Ghost Mentioned"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "S A Deal-Breaker",
          "scenes": [
            "Logistics and Landing"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-10.yaml",
      "date": "2024-04-10",
      "summary": "The CATFISHER ECHO entry. The narrator's sexting match is explicitly identified as \"the Québécoise version of the catfisher\"—the pattern from years earlier repeating. Old Snapchat photos resurface, triggering body grief: \"That led me to look at old pictures of me and how my body used to look. I miss it. I miss being OK with it and feeling attractive.\" She is called gorgeous but doesn't believe it. The disconnection between external validation and internal experience persists. Another prospect reaches out; they plan to meet Friday. The lab passes unremarkably with colleagues discussing funding, video games, and a visitor's aunt's hospital delirium.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Sexting Match Is Explicitly Identified As",
          "scenes": [
            "Medication Uncertainty",
            "The Catfisher Echo",
            "Shit on the Door Handle",
            "Empty Office at Noon",
            "The Aunt's Delirium"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "She Is Called Gorgeous But Doesn",
          "scenes": [
            "Photo Archaeology",
            "The Gorgeous Disbelief",
            "Friday Plans"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-12.yaml",
      "date": "2024-04-12",
      "summary": "Daily drinking escalates—vodka and grapefruit the first thing after returning from a date. Coffee date with Jay: two hours of conversation, no food ordered, ends with a hug and an ambiguous farewell at the metro. The aftermath spiral: \"I feel unattractive and disgusting. Unwanted.\" The logic of desire inverted—the problem isn't hookups but the unbearable ordinariness of connection that doesn't ignite. At Church pub with friends, the narrator mentions a half-decade crush who calls her \"princess\"—the backstory for the summer Mexico arc accumulating. Throughout: glancing at the phone, waiting for the rejection text, bargaining with herself to write 1500 words before checking.",
      "problematic_scenes": [
        {
          "name": "Church Pub: The Breakup Circle",
          "description": "Friends at happy hour cocktails. One friend shares about ending things with an ex she'd stayed friends with. The narrator relates.",
          "reason": "contains colon"
        }
      ],
      "problematic_events": []
    },
    {
      "file": "data/metadata/journal/2024/2024-04-13.yaml",
      "date": "2024-04-13",
      "summary": "A day of waiting for messages that don't come—from Jay, from Sy, from Paty. Depression and drinking fill the void. Paty's origin story surfaces: meeting at a Yaaj event where she confessed liking both Paola and the narrator, but chose another before anything could happen. The Sophie comparison resurfaces: Sy's message—like Sophie's—remains unseen. The waiting pattern documented across multiple threads simultaneously. Cancelled plans (Vero's wedding, gathering with friends) leave space for paralysis—no laundry, no reading, no manuscript work, just the scroll and the wait.",
      "problematic_scenes": [
        {
          "name": "Vero's Cancelled Wedding (Backstory)",
          "description": "Was supposed to be witness for the work permit marriage. He asked for 10-12k dollars. They broke up.",
          "reason": "contains parentheses"
        },
        {
          "name": "Alda's Fall (Phone)",
          "description": "She hurt her forehead and ankle on the stairs, wants to cancel. The narrator accepts gratefully.",
          "reason": "contains parentheses"
        },
        {
          "name": "Paty's Origin Story (Memory)",
          "description": "Yaaj event where Paty confessed liking Paola first, then admitted in a voice message she'd liked the narrator too—but chose someone else.",
          "reason": "contains parentheses"
        },
        {
          "name": "Narvarte Shore Nights (Memory Flash)",
          "description": "Movie of the party at Ivan's house interrupts the writing. Considers stopping.",
          "reason": "contains parentheses"
        }
      ],
      "problematic_events": [
        {
          "name": "S Messagelike Sophie",
          "scenes": [
            "Bed, All Day",
            "Morning Text to Sy",
            "Vero's Cancelled Wedding (Backstory)",
            "Alda's Fall (Phone)"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "Writing (2024-04-13)",
          "scenes": [
            "Paty's Origin Story (Memory)",
            "Double-Texting Paty",
            "Narvarte Shore Nights (Memory Flash)",
            "The French Text to a Meaningless Match"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-15.yaml",
      "date": "2024-04-15",
      "summary": "Depression weekend unmoved, but Bea arrives. A girl with a Virginia Woolf quote in her bio, \"just looking for some fun.\" The disclosure follows: \"Before getting to the plans, I'm trans, in case that gets in the way of fun for you.\" Then an hour of waiting—the familiar anxiety, feeling unwanted, disgust rising. Finally: \"No, that doesn't get in the way!\" Relief, but they don't settle on plans yet. The Virginia Woolf detail plants a seed that will bloom later—the lighthouse tattoo, the literary intimacy that will characterize their encounter. The couple from last year reappears; Sy's texts remain vapid. Bea's entrance marks a shift in the dating landscape.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "T Get In The Way",
          "scenes": [
            "Third Night of Delivery"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "Messaging (2024-04-15)",
          "scenes": [
            "What Am I Trying to Fill?",
            "Tempted to Skip"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-25.yaml",
      "date": "2024-04-25",
      "summary": "The preamble to the Bea night. Two weeks of deep depression. French class insufferable. Chloe date unremarkable. Bea cancels their first scheduled date (dog-sitting emergency). Rescheduling attempts fail around French class schedule. Then Bea offers Thursday. The narrator skips Wednesday's class to meet her. She chooses the same bar—close to Bea's house, the implication clear. \"Since we started talking, the conversation flowed with the implication that we were going to hook up.\" She puts on her nicest bra but no makeup—the calibration of effort for casual sex versus romance. At the pharmacy: \"I looked through the edge of the label trying to estimate how many they were\"—HRT anxiety persists in the background of all other concerns.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Waiting (2024-04-25)",
          "scenes": [
            "Depression Inventory",
            "Chloe at Cafe Velours",
            "Bea's Midnight Text"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2024-04-25)",
          "scenes": [
            "Sunday's Weight"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Meeting (2024-04-25)",
          "scenes": [
            "Tuesday Therapy",
            "Tabac Frustration",
            "The Proposition"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-26.yaml",
      "date": "2024-04-26",
      "summary": "THE BEA NIGHT. A vivid, fully dramatized intimate encounter—the first complete sex scene in the journal. The date flows: aphantasia, religion, nausea. Outside for a smoke. *\"Can I kiss you?\"* She places one hand on Bea's waist. *\"We kissed a thousand times like no one were watching. Her mouth tasted like tobacco and honey.\"* Bea invites her home. On the bed, the narrator confirms: *\"You do know I am trans, right?\"* Bea smiles: *\"Don't worry about it—I like girls.\"* During kissing, their teeth collide and the narrator's front tooth chips. Nervous laughter, memories of a similar incident seven years ago. They continue. Bea goes down on her. *\"Her mouth was electric.\"* The narrator reciprocates but worries she didn't make Bea cum. She fakes her own orgasm. Afterward, cuddling: Bea describes her tattoos—a lighthouse for Virginia Woolf's novel, her mother's islands. *\"She suggested joining me in what I confessed was an intimate and personal thing for me.\"*—an invitation to take her photograph. A number exchange at the door.",
      "problematic_scenes": [
        {
          "name": "The Bar: First Date Confessions",
          "description": "Two women share their pre-date anxieties over pints. Conversation flows through careers, travels, aphantasia, religion. Three rounds ordered.",
          "reason": "contains colon"
        },
        {
          "name": "The Sidewalk: The Ask",
          "description": "Night has fallen. She shivers in her denim jacket while the other smokes. A shift of weight, eyes meeting. \"Can I kiss you?\" Hand on waist.",
          "reason": "contains colon"
        },
        {
          "name": "The Walk: Five Minutes",
          "description": "Glasses abandoned half-full. They don't hold hands this time. Cold night, silent anticipation. The apartment appears.",
          "reason": "contains colon"
        },
        {
          "name": "The Bedroom: Disclosure",
          "description": "Kneeling over her on the bed, the narrator pauses. \"You do know I am trans, right?\" The smile. \"Don't worry about it—I like girls.\"",
          "reason": "contains colon"
        },
        {
          "name": "The Bedroom: The Broken Tooth",
          "description": "Mid-kiss, teeth collide. A crack. A tiny pebble between lips. Mortified laughter. Memory of seven years ago. They continue anyway.",
          "reason": "contains colon"
        },
        {
          "name": "The Bedroom: Bodies in Negotiation",
          "description": "Questions about preference. Hesitation masked by nodding. Her mouth electric. Reciprocation attempted. The faked orgasm.",
          "reason": "contains colon"
        },
        {
          "name": "The Bedroom: The Tattoos",
          "description": "Tangled together, she describes the lighthouse for Virginia Woolf, the phrase \"we remain,\" her mother's islands. Voice against chest.",
          "reason": "contains colon"
        },
        {
          "name": "The Bedroom: The Invitation",
          "description": "\"You should take me with you once.\" Photography discussed. The offer to be photographed. A future implied.",
          "reason": "contains colon"
        },
        {
          "name": "The Door: The Exchange",
          "description": "Time to leave acknowledged. \"Do you want to move outside the app?\" Doubt in grayish-blue eyes, but she accepts the phone. A closing kiss.",
          "reason": "contains colon"
        }
      ],
      "problematic_events": [
        {
          "name": "S Waist",
          "scenes": [
            "The Morning After"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-27.yaml",
      "date": "2024-04-27",
      "summary": "The morning after the connection that worked too well. The narrator repairs the body—dental clinic, Hispanic dentist, Spanish inside and French outside, the broken tooth finally fixed. Then a party at a friend's, wine-drunk processing via text: \"I was thinking how, now that I was starting to feel limerence for a new person, it'd be the perfect time for her to come back.\" The paradox articulated: \"She ruined it by being too good for me.\" A friend pushes back: \"You met her once.\" The narrator clarifies the impossible bind: \"I enjoyed talking to her too much to have had sex with her.\" Good connection makes casual sex feel like a mistake. The next morning, a new match, and the narrator discloses her trans status before another date can form.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Wine-Drunk Processing Via Text",
          "scenes": [
            "Laundry Finally Done"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-04-28.yaml",
      "date": "2024-04-28",
      "summary": "Obsessive thoughts spiral in the aftermath of a new connection. The narrator drafts texts all morning but nothing feels right. The familiar anxiety articulated: \"Having sex with someone is the perfect circumstance for an unhealthy fixation to blossom.\" She catalogs evidence against her fear: the woman asked to kiss first, invited her home, shared tattoo stories, suggested the photo session, asked her to text when she arrived home, replied. \"She hasn't disappeared. At least not yet.\" A pattern from an old fixation mapped onto new territory—the same cataloging, the same anticipation of abandonment. Wisdom tooth pain flares, prefiguring the summer surgery. Insomnia after skipping antipsychotics compounds the mental spiral.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "She Hasn",
          "scenes": [
            "The Worst Night"
          ],
          "reason": "ends with incomplete contraction (truncated)"
        },
        {
          "name": "Walking (2024-04-28)",
          "scenes": [
            "No Reason to Rise",
            "The Tooth's Lightning",
            "The Dépanneur Run",
            "Drafting All Morning",
            "The Catalog of Evidence",
            "At Least Not Yet"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-01.yaml",
      "date": "2024-05-01",
      "summary": "The obsessive spiral entry. After disappointing silence from a recent match, the narrator cycles through dating apps—deleting, texting impulsively, against therapeutic advice to take a break. A moment of self-awareness emerges: the urge to text comes from anger, not desire. The therapist offers a striking image: \"hearing my narrations I reminded her of a little girl; someone scared and hidden, unable to handle the world's expectations.\" The entry catalogs compulsive texting—a transphobic match confronted point-blank, a brief temptation toward Grindr and chasers. The pattern of disclosure-wait-rejection-repeat documented in its exhausting totality.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-05-01)",
          "scenes": [
            "The Water Dam",
            "Bed Until Noon",
            "The Unexpected Text",
            "Therapy Session",
            "A Little Girl"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-03.yaml",
      "date": "2024-05-03",
      "summary": "A day of restless hypomanic energy after waking at 3h. The narrator feels \"energetic and jumpy, a bit impulsive\" at work, meets a friend at a cafe for coffee and beers. The phone full of notifications feels like it's \"burning\"—the narrator fantasizes about throwing it onto the metro tracks, then turns it off instead. The digital device as source of compulsion, the fantasy of destruction versus the reality of simply powering down. Mother texts with worry about the cat, who has been \"kind of sad.\" The entry ends with meta-awareness: \"I feel the urge to offer it to her as a bribe to see her again\"—the journal itself becoming currency for connection.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Writing (2024-05-03)",
          "scenes": [
            "News from Home",
            "The Bribe"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-05.yaml",
      "date": "2024-05-05",
      "summary": "A first date at a brunch spot—coffee, French language banter, walking together under her umbrella in the rain. The narrator thinks about asking to kiss her but doesn't: \"Instead, we just walked.\" The almost-kiss pattern that will recur. The entry contains two disturbing confessions: telling a friend about intrusive thoughts of pushing people onto metro tracks (met with silence, the fear of being seen as monstrous), and a joke about pregnancy that leaves the narrator feeling \"soiled\"—\"I felt crawling ants tickling my spine.\" The body's dysphoric response to maternal impossibility.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Remembering (2024-05-05)",
          "scenes": [
            "Intrusive Thought Confession",
            "Pregnancy Dysphoria"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Writing (2024-05-05)",
          "scenes": [
            "The Deleted Text"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-06.yaml",
      "date": "2024-05-06",
      "summary": "Aftermath of a date. She responded to the narrator's text about not kissing in the rain: she was \"flustered,\" needs time, feels \"a little bit broken.\" The narrator apologizes, then avoids reading her follow-up French text all day—the familiar pattern of dreading rejection. Meanwhile, during French class, the narrator compulsively texts an ex—\"the one-sentence over-thought text... That is the only one that I wish goes unanswered.\" The paradox articulated: texting someone while hoping they won't respond, the compulsion overriding desire. Conference registration, therapy appointment scheduling, work meetings fill the rest.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Text About Not Kissing In The",
          "scenes": [
            "The Breakout Room",
            "The Compulsive Texting",
            "Phone Turned Down",
            "The Uncomfortable Response"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-07.yaml",
      "date": "2024-05-07",
      "summary": "The CORE WOUND entry. Bea's rejection arrives: \"I've found someone who I want to explore a relationship with so I can't meet up with you again.\" The narrator processes the loss through a compressed memory of their night: \"Four hours; two liters of alcohol... A series of smoke-flavoured kisses; a chilly walk to her apartment. One night of caresses, of childhood memories and secrets shared in soft touches and even softer voices.\" The core wound articulated with devastating clarity: \"my deep belief that I am not worthy of love... they can kiss me and take me to their place to have sex, but I am not enough to be the one to have a relationship with.\" The narrator cries through French class, hoping the camera resolution isn't high enough for anyone to notice—grief hidden in plain sight.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Rejection Arrives",
          "scenes": [
            "The Notification",
            "Reading the Rejection",
            "The Night Compressed"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        },
        {
          "name": "Writing (2024-05-07)",
          "scenes": [
            "The Question",
            "French Class as Endurance",
            "Crying in Plain Sight",
            "The Core Wound Articulated"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-10.yaml",
      "date": "2024-05-10",
      "summary": "Dr. Franck lowers the medication dose to 20mg, adjusting the chemical balance. The narrator goes on a date with Camille despite knowing there's no attraction—feeling guilty about her own lack of interest, the ethics of continuing when the spark is absent. The core wound continues its articulation: \"Why is it so easy for me to believe that most women I've dated were disappointed by my looks as soon as they saw me?\" The projection of rejection onto every encounter. Mentions of past women (Amanda, Valerie, Alexandra) provide background but remain undeveloped.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Dreaming (2024-05-10)",
          "scenes": [
            "The Video Call",
            "The Return to Sleep"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-12.yaml",
      "date": "2024-05-12",
      "summary": "A picnic date in the park that proceeds without spark. The narrator reflects on what differentiates meaningful dates from forgettable ones, mentally cataloging past encounters that mattered—a palimpsest of romantic history against which this afternoon pales. Later at a friend's apartment, she sees a photo of herself and is \"repulsed by it,\" imagining her date's disgust upon first seeing her. The pillow at home smells like \"dying flowers\"—\"If depression had a smell, I imagine it would be that withering sweetness.\" The sensory metaphor capturing slow decay.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "S Apartment She Sees A Photo Of",
          "scenes": [
            "Morning in Bed",
            "Dressing for the Date",
            "Walking to the Park",
            "Finding Her Date",
            "The Non-Event of Meeting",
            "Poutine Restaurant",
            "Blankets on Grass"
          ],
          "reason": "starts with single letter T/S (likely truncated)"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-13.yaml",
      "date": "2024-05-13",
      "summary": "A day at a Google workshop, lunch at McGill with colleagues. The narrator resists impulses to buy alcohol on the walk home, then cycles through deleting and redownloading dating apps—preemptive rejection before being rejected. The entry ends with a confession to a friend: the first kiss may have been sexual assault. A disclosure dropped casually, undeveloped.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-05-13)",
          "scenes": [
            "The Couch Ritual",
            "Pre-Class Unmatching",
            "The Confession"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-21.yaml",
      "date": "2024-05-21",
      "summary": "Lost weekend to depression. Brief beer with friend at terrace—social maintenance rather than connection. Fasting continues: \"I haven't eaten anything all day and I feel tempted to continue the fast indefinitely.\" The desire to disappear through not-eating. The epigraph is a formal excuse in French explaining the depressive episode—the narrator performing functionality while falling apart, composing polite bureaucratic French from bed.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Waiting (2024-05-21)",
          "scenes": [
            "Couch, Not Watching",
            "Venue Negotiation",
            "Waiting at the Terrace",
            "Two Hours Chatting"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Messaging (2024-05-21)",
          "scenes": [
            "Haven't Been Outside Since",
            "Declining Beer",
            "Monday Lost"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "At Table (2024-05-21)",
          "scenes": [
            "Wet Hair on Screen",
            "The Fast Temptation",
            "Waiting on Hold",
            "Skipping French"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-27.yaml",
      "date": "2024-05-27",
      "summary": "A 36-hour fast documented across a weekend of social obligations. Friday: two clementines, nothing else. Saturday: terrace cocktails with friends, then an awkward party where they're underdressed outsiders drinking only water—the narrator refuses food despite nausea. Sunday: taxes at a friend's apartment, finally eating pizza. Monday: a bipolar study call where she fears disclosure but stays silent; dating apps redownloaded despite swearing them off; a Reddit thread on genital preferences triggers dysphoria. The body punishes the will, but the will keeps punishing back.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-05-27)",
          "scenes": [
            "The Study Call",
            "Reddit Dysphoria",
            "New Match, Old Pattern",
            "French Class Abandoned"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-05-30.yaml",
      "date": "2024-05-30",
      "summary": "A fragmented entry dominated by insomnia and the logistics of a deteriorating life. The narrator hasn't slept properly in days, misses buses and metros due to service interruptions, loses weight from fasting. A brief flirtation (head rubs, lunch invitation) goes unanswered. The doctor notes high estrogen levels during an HRT check-up. The entry's emotional center is a spontaneous breakdown on the metro platform: sitting at the end, head falling forward, tears rolling down as she watches the train leave without boarding. The first dose of Seroquel marks a medicalization threshold.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Dreaming (2024-05-30)",
          "scenes": [
            "The Sleepless Dawn"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "Walking (2024-05-30)",
          "scenes": [
            "The Metro Announcement",
            "The Dismissive Bus",
            "The Flirtation Text"
          ],
          "reason": "contains date in parentheses"
        },
        {
          "name": "At Table (2024-05-30)",
          "scenes": [
            "The Weight Discovery",
            "Bargaining with Sunlight",
            "The Calm Office Morning",
            "The Project's Dismissal"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-06-02.yaml",
      "date": "2024-06-02",
      "summary": "The first meeting with the friend who will become the narrator's closest confidante through the entire romantic obsession arc before their eventual rupture. The epigraph records their first significant exchange: \"Have you ever been in a toxic relationship?\" The narrator confesses, *\"In my relationships, I've been the toxic one.\"* This prescient admission foreshadows everything that follows. The meeting happens casually at a pizza place after a coffee expo the narrator missed due to medication-induced oversleeping. Plans to watch TV dissolve into hours of gossip about past relationships—the first of many nights this new friend will spend absorbing the narrator's romantic dramas.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-06-02)",
          "scenes": [
            "The First Thing",
            "The Sleepless Night",
            "Empty Sunday"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    },
    {
      "file": "data/metadata/journal/2024/2024-07-01.yaml",
      "date": "2024-07-01",
      "summary": "A sprawling 7000-word entry covering a full week in Mexico City (June 21-30, 2024) before flying to Tijuana. The narrator stays with a friend, navigates constant misgendering while presenting femininely but in \"masculine\" clothes, and has three charged encounters with a woman from their LGBTQ+ group days. The central tension: an almost-romance that never consummates in a kiss. They hold hands, sit intimately at a hidden fountain, gaze into each other's eyes at an intersection—but neither initiates. The entry opens with the devastating epigraph: *\"¿Me vas a dejar irme otra vez sin besarme?\"* (Are you going to let me leave again without kissing me?). Other events include: getting two tattoos (a phoenix and a plant branch), an in-person therapy session where the narrator confesses thoughts of detransitioning, a bar night where they almost kiss another woman, and a final reunion with Nymeria at home.",
      "problematic_scenes": [],
      "problematic_events": [
        {
          "name": "Messaging (2024-07-01)",
          "scenes": [
            "Nymeria's Welcome"
          ],
          "reason": "contains date in parentheses"
        }
      ]
    }
  ]
}