{
  "scenes": {
    "2024-02-13": [
      {
        "current": "INT. BEDROOM - 1-2 AM",
        "proposed": "Changing the Sheets Without Worry",
        "description": "Sofia turns on the night light and retrieves clean sheets unused during Sonny's month-long stay. Changing bedding without the anxiety that accompanied erasing Monica's scent.",
        "rationale": "Screenplay format is inappropriate for narrative analysis. The evocative name captures the emotional core: the contrast between how Sofia let go of Sonny's scent vs. Monica's, revealing the hierarchy of attachments."
      },
      {
        "current": "INT. BEDROOM - EARLY MORNING",
        "proposed": "The Unplugged Router",
        "description": "Internal battle - stay home or meet Louis. The weather app won't load. Sofia traces the failure to a knocked-out plug - sheets thrown carelessly last night.",
        "rationale": "Screenplay format removed. The name focuses on the specific detail that makes this scene memorable: discovering why the internet doesn't work."
      },
      {
        "current": "INT. KITCHEN/DESK - 10 AM",
        "proposed": "Twenty Minutes with Louis",
        "description": "Coffee, work, a 20-minute Teams call with Louis.",
        "rationale": "Time-and-location format is too generic. The evocative name specifies the interaction that gives this scene narrative weight."
      },
      {
        "current": "INT. KITCHEN - NOON",
        "proposed": "Solo Breakfast",
        "description": "Eggs and ham. A late breakfast cooked solo.",
        "rationale": "Generic location-time format replaced with simple evocative name that captures the solitary domestic moment."
      },
      {
        "current": "INT. APARTMENT - AFTERNOON",
        "proposed": "Guilt Arithmetic for Vlad",
        "description": "A text from Aliza - Vlad wants Sofia at Church Saturday. Guilt arithmetic - cancelled on her last time. The energy calculation for Vlad.",
        "rationale": "There are two scenes with identical names 'INT. APARTMENT - AFTERNOON' in this file. This is the first one, about calculating social obligations. The name captures the emotional mathematics described."
      },
      {
        "current": "FLASHBACK: EXT. PARC LA FONTAINE - YEARS AGO",
        "proposed": "Laura and the Undeveloped Roll",
        "description": "Laura, the Colombian exchange student. Film cameras. A roll left undeveloped for years. She posted about the card game on Instagram.",
        "rationale": "Screenplay flashback format is inappropriate. The evocative name captures both the person and the lingering unfinished artifact connecting past to present."
      },
      {
        "current": "INT. APARTMENT - AFTERNOON",
        "proposed": "Drinks for the Card Game",
        "description": "Planning with Alda over text. The card game meant for Julian, redirected. Wine reconsidered as too romantic. Settling on amaretto and ginger beers.",
        "rationale": "This is the second 'INT. APARTMENT - AFTERNOON' scene. The name focuses on the specific planning activity: choosing beverages with intentionality about what they signal."
      },
      {
        "current": "INT. APARTMENT - FRENCH CLASS",
        "proposed": "French Class, Camera Off",
        "description": "Focus deteriorating. This time Sofia waits until class ends to write.",
        "rationale": "Generic location-activity format replaced with name that captures the specific behavior: staying in class but checking out."
      },
      {
        "current": "INT. APARTMENT - EVENING",
        "proposed": "Sophie or Tirza",
        "description": "The texting dilemma. Sophie or Tirza? Sofia always reaches out to Tirza when disillusioned with Sophie. 'I know what I should do, but I don't know if I can.'",
        "rationale": "Generic time-location format replaced with the core dilemma articulated in the scene itself: choosing between two potential connections."
      }
    ]
  },
  "events": {
    "2024-01-28": [
      {
        "current": "At Bon Délire",
        "proposed": "The Sophie Saga Begins",
        "description": "Scenes about meeting Sophie at Bar Pamplemousse and breaking the promise not to talk about her.",
        "rationale": "Generic 'At [location]' format replaced with evocative name that captures the narrative significance: this is where the Sophie arc starts."
      },
      {
        "current": "At Baja California",
        "proposed": "Holiday Silence and Chronic Pain",
        "description": "No contact through Christmas and New Year's; the first cancellation when Sophie's chronic pain flares.",
        "rationale": "Location-based name replaced with thematic name capturing the two key dynamics: the absence during holidays and the first appearance of Sophie's pain as reason for cancellation."
      },
      {
        "current": "At Le toasteur",
        "proposed": "The Cat Emergency and Alexandra's Ghost",
        "description": "Waiting outside the brunch spot; Sophie's cat vomiting blood; the cafe window memory of Alexandra kissed goodbye twice.",
        "rationale": "Location-based name replaced with dual focus: the immediate crisis (cat) and the haunting memory (Alexandra) that surfaces in its wake."
      },
      {
        "current": "Waiting (2024-01-28)",
        "proposed": "Four Texts Too Many",
        "description": "Messages stay unseen; breaking the double-texting rule; four messages sent while fighting the urge to confess kiss regret.",
        "rationale": "Date-in-parentheses format is inappropriate. The name captures the specific transgression: sending four messages despite knowing better."
      }
    ],
    "2024-01-29": [
      {
        "current": "Writing (2024-01-29)",
        "proposed": "The Archive at 1 AM",
        "description": "Late-night reading through old journal entries revealing the Kate pattern; waking Sonny to share the discovery.",
        "rationale": "Generic activity-plus-date replaced with evocative name focusing on the specific activity: diving into old journals in the middle of the night."
      },
      {
        "current": "At McGill campus",
        "proposed": "Coordinating the Scaffolding",
        "description": "Planning logistics of therapy sessions, campus meetings, online classes; the scaffolding of daily life negotiated.",
        "rationale": "Generic location name replaced with metaphorical name that captures what's happening: building the structural support for daily functioning."
      },
      {
        "current": "At Montreal airport",
        "proposed": "Monica's Visit Remembered",
        "description": "Airport pickup, groceries, movies, the un-trespassable barrier in the shared bed.",
        "rationale": "Generic location replaced with name that identifies the specific memory being recalled and its emotional significance."
      },
      {
        "current": "Messaging (2024-01-29)",
        "proposed": "The Monica Urge Confession",
        "description": "The shower arrangement; the devastating parallel between sexual urge with Sonny and self-harm urge with Monica.",
        "rationale": "Generic activity-date format replaced with name capturing the crucial psychological revelation: the explicit connection between different urges for different attachments."
      }
    ],
    "2024-01-30": [
      {
        "current": "4 Moment",
        "proposed": "ChatGPT at 4 AM",
        "description": "Waking in darkness, submitting the Sophie situation to ChatGPT seeking reassurance; the AI echoes what friends said.",
        "rationale": "Truncated/unclear name replaced with specific evocative name: consulting AI in the middle of the night for romantic advice."
      },
      {
        "current": "At Wellness Hub",
        "proposed": "Therapy Day",
        "description": "Searching for tear-jerker films, morning at the lab, the waiting room, therapy session addressing Sophie.",
        "rationale": "Generic location name replaced with clear descriptor of what unifies these scenes: the day centered around therapy."
      },
      {
        "current": "At CaPS",
        "proposed": "The Textual Repetition Discovery",
        "description": "Waiting in the lobby, burgers and dark beer with Sonny, discovering the exact same kiss-regret text was sent two years earlier.",
        "rationale": "Generic location acronym replaced with name capturing the major revelation: finding proof of the exact same words sent to different women across time."
      }
    ],
    "2024-01-31": [
      {
        "current": "Pero No Te Va A Responder",
        "proposed": "The Heaviness of Unsent",
        "description": "French class irritability, editorial crisis, the unsent message and its weight.",
        "rationale": "Spanish phrase (though evocative) is less accessible. New name captures the physical/emotional sensation described: heaviness in the chest from the unsent text."
      },
      {
        "current": "Podemos Ser Amigas",
        "proposed": "Late Rising and Coffee Plea",
        "description": "Past noon waking; almost begging Sonny to go out for coffee and breakfast.",
        "rationale": "Spanish phrase replaced with description of the specific domestic moment: the desperate need to leave the apartment."
      },
      {
        "current": "At Dieu du ciel!",
        "proposed": "The Springtime Date That Faded",
        "description": "Aliza sheepishly asking Sonny if they can be friends; memory of 9-hour canal walk with Jerica that led nowhere.",
        "rationale": "Generic bar name replaced with name capturing the thematic core: remembering a long promising date that vanished into nothing."
      }
    ],
    "2024-02-01": [
      {
        "current": "Messaging (2024-02-01)",
        "proposed": "The Text Ready to Send",
        "description": "The composed text to Sophie, its measured care belying the weight behind it.",
        "rationale": "Generic activity-date format replaced with name capturing the specific state: message composed and waiting, the moment before action."
      },
      {
        "current": "At Salamanca",
        "proposed": "Lovesick and Salamanca Ghosts",
        "description": "Watching the British series with Sonny; memory of Raul and Alberto from Salamanca surfacing.",
        "rationale": "Generic location replaced with dual focus: the show being watched and the memories it triggers."
      },
      {
        "current": "Mind Moment",
        "proposed": "Windows Restarts Unbidden",
        "description": "The decision crystallizes; computer boots into Linux at 4 AM; insomnia wins; the half-remedy for the clogged drain.",
        "rationale": "Vague/truncated name replaced with specific evocative detail: the computer's unexpected behavior during a sleepless night."
      },
      {
        "current": "Meeting (2024-02-01)",
        "proposed": "6:50 AM Send",
        "description": "The text sent fresh from the bathroom; timer restarts; the possibility of Sophie's initiative traded for peace of mind; the trans non-disclosure continues.",
        "rationale": "Generic activity-date format replaced with the specific temporal marker that makes this moment significant: the exact time the message goes out."
      }
    ],
    "2024-02-03": [
      {
        "current": "Would Love To See You",
        "proposed": "Testing the Kodak Pony",
        "description": "Clogged drain irritation, photo lab queue, loading cheap film into the vintage camera, the disappointing Totem screening.",
        "rationale": "This event name duplicates a scene name. The new name focuses on a specific memorable action: using the newly purchased vintage camera."
      },
      {
        "current": "At Du College station",
        "proposed": "The $35 Camera Pickup",
        "description": "The Facebook Marketplace find, negotiations with seller, coffee at Tim Hortons, staying at the door to pay cash.",
        "rationale": "Generic metro station name replaced with name capturing the transaction: acquiring the vintage camera."
      },
      {
        "current": "At la boulangerie",
        "proposed": "Sonny Reads It First",
        "description": "The dreaded notification from Sophie; handing Sonny the phone; 'would love to see you' with a red heart; no relief, only new anxiety.",
        "rationale": "Generic location replaced with the specific behavior that defines this moment: letting Sonny screen the message before reading it herself."
      }
    ],
    "2024-02-04": [
      {
        "current": "At Berri UQAM",
        "proposed": "Masturbation and Disgust",
        "description": "Sonny leaves for Mass; hands inside shorts, facing the wall; the stains discovered later; disgust that fades quickly.",
        "rationale": "Generic metro location replaced with frank description of the scenes' content: the sexual act and the self-disgust that follows."
      },
      {
        "current": "At Ginkgo",
        "proposed": "Brunch Crawl Through the Plateau",
        "description": "Swing seats at the restaurant, pitcher of Paloma, bar hopping, kicked out gently from La Banquise, Portuguese counter poutine.",
        "rationale": "Single restaurant name replaced with description of the activity: moving between multiple brunch/bar locations."
      },
      {
        "current": "At Table (2024-02-04)",
        "proposed": "Half-Eaten Surrender",
        "description": "Home, barely half the poutine touched, giving up on the day.",
        "rationale": "Generic location-date format replaced with evocative name describing the action: abandoning food and day simultaneously."
      }
    ],
    "2024-02-05": [
      {
        "current": "I Miss My Body",
        "proposed": "The Body's Archive",
        "description": "Pre-dawn writing, coffee errand, disappointing Cuba scans, organizing old photos watching the body change through years.",
        "rationale": "While 'I Miss My Body' is evocative, it duplicates the entry's core confession. 'The Body's Archive' captures the specific activity: seeing bodily transformation documented in Google Photos."
      },
      {
        "current": "Messaging (2024-02-05)",
        "proposed": "French Class Breakdown",
        "description": "Screenshots of rejection, inability to focus in French class, the texting paradox with Sophie, Instagram incident with Alda, crying after class.",
        "rationale": "Generic activity-date format replaced with the emotional climax: the moment in French class when Sofia feels 'I can't do this anymore.'"
      },
      {
        "current": "Cyclical Moment",
        "proposed": "The Exact Same Spot",
        "description": "The final recognition - 'I'm at the exact same spot I was two years ago.'",
        "rationale": "Generic time-based name replaced with the specific language from the confession: being in the exact same spot, the cyclical pattern named."
      }
    ],
    "2024-02-11": [
      {
        "current": "S Day To See The Cuba Photos",
        "proposed": "The Empty House",
        "description": "Silence fills the apartment after Sonny's departure.",
        "rationale": "Truncated/garbled name replaced with simple evocative description: the apartment transformed by absence."
      },
      {
        "current": "T Be Enough",
        "proposed": "The Week Before Airport",
        "description": "Pedro's challenge at the lab, outlet shopping with friends, Venezuelan dinner, waiting for the bus, the locked door.",
        "rationale": "Truncated name (likely 'Won't Be Enough') replaced with temporal marker that gives these scenes narrative context: the days leading up to Sonny's departure."
      },
      {
        "current": "Waiting (2024-02-11)",
        "proposed": "For the First Time, Not Waiting",
        "description": "Sophie's notification about Valentine's lunch; the first time Sofia stops waiting for notifications; La vie revee screening; kung pao chicken dinner.",
        "rationale": "Generic activity-date format replaced with the psychological victory articulated in the entry: finally not obsessively waiting."
      },
      {
        "current": "Airport Moment",
        "proposed": "The Longest Commute Home",
        "description": "Friday gnocchi and beers, photos of Sonny, airport goodbye, headphones on for the bus, the journey home stretching impossibly.",
        "rationale": "Generic time-based name replaced with the specific observation from the entry: how the commute home after dropping Sonny felt endless."
      }
    ],
    "2024-02-12": [
      {
        "current": "Ll Meet She",
        "proposed": "Side Effects at Dawn",
        "description": "Early rising after medication-induced anguish, morning commute, room full of engineers, three minutes with supervisor.",
        "rationale": "Truncated/garbled name (likely part of 'I'll meet she'll enjoy it she won't disclose') replaced with the opening scene's focus: waking with medication side effects."
      },
      {
        "current": "At la fruiterie",
        "proposed": "The Sophie Prediction",
        "description": "Graphical abstract work, French class paradox, unsent message to Tirza, cynical forecast of how the Sophie date will unfold.",
        "rationale": "Generic location replaced with the climactic scene: predicting exactly how the date will go and end."
      }
    ],
    "2024-02-13": [
      {
        "current": "S Was Planning To Play We",
        "proposed": "Changing Sheets at 1 AM",
        "description": "Turning on the night light, retrieving clean sheets, changing bedding without anxiety about erasing Sonny's scent; the unplugged router discovered; coffee and Teams call; solo breakfast.",
        "rationale": "Truncated/garbled name (likely from 'I was planning to play We're Not Really Strangers') replaced with the opening action: the late-night sheet change that contrasts with Monica's scent preservation."
      },
      {
        "current": "Lately I Have Been Craving Intimacy",
        "proposed": "The Card Game Redirected",
        "description": "Guilt arithmetic for Vlad's invitation, remembering Laura and the undeveloped film roll, planning with Alda, the game meant for Julian now redirected.",
        "rationale": "While the confession is powerful, as an event name it's too abstract. The new name captures the concrete action: redirecting the intimacy card game from one person to another."
      },
      {
        "current": "Writing (2024-02-13)",
        "proposed": "Sophie or Tirza Dilemma",
        "description": "French class with deteriorating focus, the texting dilemma between Sophie and Tirza, the pattern of reaching out to Tirza when disillusioned.",
        "rationale": "Generic activity-date format replaced with the core conflict articulated: choosing between two different romantic possibilities."
      }
    ],
    "2024-02-14": [
      {
        "current": "T Let It Out",
        "proposed": "Corner Table Before the Date",
        "description": "Sitting in Thomson House corner table, having moved from a single seat, contemplating going home or stopping for amaretto.",
        "rationale": "Truncated name (likely 'Can't Let It Out') replaced with concrete scene-setting: the physical space before the Valentine's date."
      },
      {
        "current": "Messaging (2024-02-14)",
        "proposed": "The Red Heart Text",
        "description": "Sending the reluctant message to Sophie with red heart punctuation, last bowl of Sonny's beans, brushing teeth but skipping shower.",
        "rationale": "Generic activity-date format replaced with specific detail: the red heart added to the text despite self-hatred for sending it."
      },
      {
        "current": "Meeting (2024-02-14)",
        "proposed": "The Dead-or-Alive Box",
        "description": "Waking at 2 AM, refusing to check the phone, the message existing in quantum state, Sophie's response with blue heart, giving phone number.",
        "rationale": "Generic activity-date format replaced with the metaphor from the entry: the message as Schrödinger's cat until the screen lights up."
      },
      {
        "current": "Waiting (2024-02-14)",
        "proposed": "Showing the Cuba Photos",
        "description": "Sophie arrives on time, showing the promised pictures, sensing she's rushed, the suspicion of placation, both urges suppressed - to kiss and to cry.",
        "rationale": "Generic activity-date format replaced with the concrete action that ostensibly justifies the meeting: showing the Cuba photographs."
      }
    ],
    "2024-02-16": [
      {
        "current": "Sleepless Moment",
        "proposed": "Excruciating Leg Pain",
        "description": "Awake most of the night with leg pain, postponing alarm, calling in sick.",
        "rationale": "Generic time-based name replaced with the specific physical cause: the leg pain that prevents sleep and work."
      },
      {
        "current": "Writing (2024-02-16)",
        "proposed": "Perception, Connection, Reflection",
        "description": "Romance fiction unwatched, Dieu du ciel! beer, opening the red box with Alda, the three levels of We're Not Really Strangers, calling Sonny, IGA interlude, vomiting twice, drunk drafting to Sophie.",
        "rationale": "Generic activity-date format replaced with the three levels of the card game that structure the evening: the game's own framework."
      }
    ],
    "2024-02-17": [
      {
        "current": "The Trans Girl She Once Fucked",
        "proposed": "Planning the Irish Pub",
        "description": "A wordless day talking to herself, planning the weekend with friends at the Irish pub, weight-loss bet commitment.",
        "rationale": "This event name duplicates a scene name. The new name captures the concrete social planning that frames these scenes."
      },
      {
        "current": "Yesterday I Found Out Sophie",
        "proposed": "The Almost-Skipped Dinner",
        "description": "Considering skipping dinner and pills, eventually heating leftover pizza and doing the words.",
        "rationale": "Truncated/incomplete name (likely 'Yesterday I Found Out Sophie's Last Name') replaced with the specific scene content: nearly skipping self-care routines."
      },
      {
        "current": "The Self-Assessment Is Brutal These Traits Are",
        "proposed": "Five Obsessions Catalogued",
        "description": "The forgotten dream, Alexia masturbation memory, fear of being 'the trans girl she once fucked,' the obsession catalog from Monica to Sophie.",
        "rationale": "Incomplete/garbled name replaced with clear descriptor: cataloguing all five romantic obsessions and their surveillance methods."
      },
      {
        "current": "Alone at Home (3)",
        "proposed": "Sophie's Last Name",
        "description": "Yesterday she found it out. The pattern continues.",
        "rationale": "Generic location-plus-number name replaced with the specific transgression: discovering Sophie's last name through digital investigation."
      }
    ],
    "2024-02-18": [
      {
        "current": "Morning Moment",
        "proposed": "Water Weight Victory",
        "description": "Weighing himself, back to the starting weight of the bet, small victory whether water-based or not.",
        "rationale": "Generic time-based name replaced with specific content: the temporary weight loss measured on the scale."
      },
      {
        "current": "At Le Trèfle",
        "proposed": "Aliza's Relationship on the Rocks",
        "description": "Window table at the Irish pub, reflection that conversations center on his life not hers, her girlfriend going through hard time.",
        "rationale": "Generic location replaced with the actual content: Aliza's relationship troubles finally getting center stage."
      },
      {
        "current": "Walking (2024-02-18)",
        "proposed": "The 70 Kilogram Self",
        "description": "Planning the week ahead, grocery run to IGA, reading old journal entries from Kate to Amanda, body nostalgia for Puerto Vallarta weight.",
        "rationale": "Generic activity-date format replaced with the specific body image obsession: the weight from the old journal entries when Sofia felt attractive."
      }
    ]
  }
}
